-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\ado\ian\mvmeta\testlogs\mvmeta_cscript.log
  log type:  text
 opened on:   7 Apr 2022, 17:42:58

. 
. version 16

. if c(version)>=13 cls

. cscript mvmeta
-------------------------------------------------------------------BEGIN mvmeta

. prog drop _all

. set more off

. set trace off

. pause off // on to check output in detail, off for fast run through

. global F5 exit;

. 
. prog def dicmd
  1. * works for version (6?) 7 or 8
. noi di as input _newline(2) `"`0'"'
  2. `0'
  3. end

. 
. which mvmeta
c:\ado\ian\mvmeta\package\mvmeta.ado
*! version 4.0.1 # Ian White # 07apr2022

. 
. use telomerase2, clear
(Riley's telomerase data)

. gen id=_n

. gen one=1

. gen study10 = id==10

. gen studychar = "Study "+string(study)

. encode studychar, gen(studynum)

. label def study10 0 "Studies 1-9" 1 "Study 10"

. label val study10 study10

. mat P2=(1,0.5\0.5,1)

. 
. // CHECK HANDLING OF MISSING COVARIATE
. mvmeta y S study in 2/l
Note: using method reml
Note: regressing y1 on study
Note: regressing y2 on study
Note: 9 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -24.507397
rescale:       log likelihood = -24.507397
rescale eq:    log likelihood = -24.507397
Iteration 0:   log likelihood = -24.507397  
Iteration 1:   log likelihood = -24.387844  
Iteration 2:   log likelihood = -24.385388  
Iteration 3:   log likelihood = -24.385379  
Iteration 4:   log likelihood = -24.385379  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -24.385379         Number of observations  =     9
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
y1           |
       study |   .0006762   .0855901     0.01   0.994    -.1670774    .1684298
       _cons |   1.155506    .542334     2.13   0.033     .0925513    2.218461
-------------+----------------------------------------------------------------
y2           |
       study |  -.1381387   .2339374    -0.59   0.555    -.5966476    .3203702
       _cons |   2.779221   1.529108     1.82   0.069    -.2177751    5.776218
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .50777704          1          .
y2  1.7247102         -1          1
----------------------------------------------------

. pause

. local ll = e(ll)

. gen study2 = study in 2/l
(1 missing value generated)

. mvmeta y S study2
Note: using method reml
Note: regressing y1 on study2
Note: regressing y2 on study2
Warning: 1 observation has observed outcome and missing covariate, and has been
>  dropped from analysis
Note: 9 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -24.507397
rescale:       log likelihood = -24.507397
rescale eq:    log likelihood = -24.507397
Iteration 0:   log likelihood = -24.507397  
Iteration 1:   log likelihood = -24.387844  
Iteration 2:   log likelihood = -24.385388  
Iteration 3:   log likelihood = -24.385379  
Iteration 4:   log likelihood = -24.385379  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -24.385379         Number of observations  =     9
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
y1           |
      study2 |   .0006762   .0855901     0.01   0.994    -.1670774    .1684298
       _cons |   1.155506    .542334     2.13   0.033     .0925513    2.218461
-------------+----------------------------------------------------------------
y2           |
      study2 |  -.1381387   .2339374    -0.59   0.555    -.5966476    .3203702
       _cons |   2.779221   1.529108     1.82   0.069    -.2177751    5.776218
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .50777704          1          .
y2  1.7247102         -1          1
----------------------------------------------------

. pause 

. assert abs(e(ll)-`ll')<1E-12

. mvmeta y S, eq(y1:study2, y2:study2)
Note: using method reml
Note: regressing y1 on study2
Note: regressing y2 on study2
Warning: 1 observation has observed outcome and missing covariate, and has been
>  dropped from analysis
Note: 9 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -24.507397
rescale:       log likelihood = -24.507397
rescale eq:    log likelihood = -24.507397
Iteration 0:   log likelihood = -24.507397  
Iteration 1:   log likelihood = -24.387844  
Iteration 2:   log likelihood = -24.385388  
Iteration 3:   log likelihood = -24.385379  
Iteration 4:   log likelihood = -24.385379  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -24.385379         Number of observations  =     9
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
y1           |
      study2 |   .0006762   .0855901     0.01   0.994    -.1670774    .1684298
       _cons |   1.155506    .542334     2.13   0.033     .0925513    2.218461
-------------+----------------------------------------------------------------
y2           |
      study2 |  -.1381387   .2339374    -0.59   0.555    -.5966476    .3203702
       _cons |   2.779221   1.529108     1.82   0.069    -.2177751    5.776218
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .50777704          1          .
y2  1.7247102         -1          1
----------------------------------------------------

. pause 

. assert abs(e(ll)-`ll')<1E-12

. 
. // and missing outcome
. gen z1=y1 in 2/l
(1 missing value generated)

. gen z2=y2 in 2/l
(1 missing value generated)

. mvmeta z S study
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Warning: 1 observation has all outcomes missing, and has been dropped from anal
> ysis
Note: 9 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -24.507397
rescale:       log likelihood = -24.507397
rescale eq:    log likelihood = -24.507397
Iteration 0:   log likelihood = -24.507397  
Iteration 1:   log likelihood = -24.387844  
Iteration 2:   log likelihood = -24.385388  
Iteration 3:   log likelihood = -24.385379  
Iteration 4:   log likelihood = -24.385379  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -24.385379         Number of observations  =     9
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0006762   .0855901     0.01   0.994    -.1670774    .1684298
       _cons |   1.155506    .542334     2.13   0.033     .0925513    2.218461
-------------+----------------------------------------------------------------
z2           |
       study |  -.1381387   .2339374    -0.59   0.555    -.5966476    .3203702
       _cons |   2.779221   1.529108     1.82   0.069    -.2177751    5.776218
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .50777704          1          .
z2  1.7247102         -1          1
----------------------------------------------------

. pause 

. assert abs(e(ll)-`ll')<1E-12

. replace z2=y2
(1 real change made)

. 
. // OPTIONS
. local pbestopt pbest(min in 2/5, all gen(rank) zero predict saving(z) replace
>  mcse id(study) seed(641))

. local wtsd wt(sd details format(%5.3f) keepmat(SD) unscaled wide)

. local wtrv wt(rv details format(%5.3f) keepmat(RV))

. local wtdpc wt(dpc details format(%5.3f) keepmat(DPC))

. local bubble bubble(name(bubble,replace) yline(0) xline(0) ///
>         col(blue green black =) lwidth(.2 = = .6) lpatt(solid = dash solid))

. local forest forest(title(Forest plot) name(forest,replace) ///
>         xli(0) subtitle(,size(large)) ///
>         xlab(,labsize(large)) ylab(,labsize(large)) ///
>         xrescale uv(line predict) mv(line predict) weights(align(c)) ytick(no
> ne))

. local pi pi(format(%9.5f) level(80))

. 
. local replayoptssep /// replay options to be run separately
>         showall "`forest'" eform eform(EFORM) nouncertainv print(bscov) ///
>     print(bscorr) level(90) dof(n-2) i2 "pbest(min, seed(641))" "`pbestopt'" 
> ///
>         nowt "`wtsd'" "`wtrv'" "`wtdpc'" testsigma qscalar randfix randfix(z*
> ) ///
>         "`bubble'" pi "`pi'"

. 
. local replayoptstog /// replay options to be run together
>         showall eform(EFORM) nouncertainv print(bscov) level(90) ///
>     dof(n-2) i2 `pbestopt' `wtsd' testsigma qscalar randfix(z*) `bubble' `for
> est' 

. 
. local estimateoptssep /// estimate options to be run separately
>         fixed mm mm1 mm2 reml ml vars(z2) start(I(2)) showstart ///
>     longparm wscorr(0) wscorr(riley) ///
>     "mm notrunc" missest(1) missvar(1E5) maxse(3) noconstant psdcrit(1E-3) no
> posdef ///
>     "bscov(uns)" "bscov(prop I(2))" "bscov(equal I(2))" "bscov(corr P2)" ///
>         "bscov(exch 0.5)" "bscov(exch)" ///
>         quick commonparm id(study) id(studychar) id(studynum)

. 
. local estimateoptstog /// estimate options to be run together
>         showstart longparm ///
>     missest(1) missvar(1E5) maxse(3) noconstant psdcrit(1E-3) id(studychar)

. 
. // CHECK REPLAY OPTIONS ONE BY ONE
. foreach replayopt in `replayoptssep' {
  2.     dicmd mvmeta z S study, `replayopt'
  3. pause 
  4.         cap drop rank*
  5. }


mvmeta z S study, showall
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
-------------+----------------------------------------------------------------
chol11       |
       _cons |   .4832159   .1773447     2.72   0.006     .1356266    .8308052
-------------+----------------------------------------------------------------
chol12       |
       _cons |  -1.611068   .4858899    -3.32   0.001    -2.563395   -.6587411
-------------+----------------------------------------------------------------
chol22       |
       _cons |   1.02e-08   1.349502     0.00   1.000    -2.644976    2.644976
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, forest(title(Forest plot) name(forest,replace)         xli(0)
>  subtitle(,size(large))         xlab(,labsize(large)) ylab(,labsize(large))  
>        xrescale uv(line predict) mv(line predict) weights(align(c)) ytick(non
> e))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------
Sorry, forest plot is not yet available


mvmeta z S study, eform
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             |  exp(Coef)   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.008274   .0788073     0.11   0.916     .8650634    1.175192
       _cons |   2.999758    1.44811     2.28   0.023     1.164596    7.726753
-------------+----------------------------------------------------------------
z2           |
       study |   .8465394   .1632877    -0.86   0.388      .580043    1.235475
       _cons |   19.50854   23.55008     2.46   0.014     1.830973    207.8585
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, eform(EFORM)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             |      EFORM   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.008274   .0788073     0.11   0.916     .8650634    1.175192
       _cons |   2.999758    1.44811     2.28   0.023     1.164596    7.726753
-------------+----------------------------------------------------------------
z2           |
       study |   .8465394   .1632877    -0.86   0.388      .580043    1.235475
       _cons |   19.50854   23.55008     2.46   0.014     1.830973    207.8585
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, nouncertainv
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0776958     0.11   0.916    -.1440415    .1605205
       _cons |   1.098532   .4800219     2.29   0.022      .157706    2.039357
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928035    -0.86   0.388    -.5444864    .2112893
       _cons |   2.970853   1.205589     2.46   0.014     .6079409    5.333764
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, print(bscov)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
            z1          z2
z1   .23349763
z2  -.77849362   2.5955395
-------------------------------------------------


mvmeta z S study, print(bscorr)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, level(90)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [90% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1203232    .1368023
       _cons |   1.098532   .4827421     2.28   0.023     .3044916    1.892572
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388    -.4838718    .1506747
       _cons |   2.970853   1.207168     2.46   0.014     .9852383    4.956467
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, dof(n-2)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
                                               Degrees of freedom      =     8
------------------------------------------------------------------------------
             | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.919    -.1719991    .1884782
       _cons |   1.098532   .4827421     2.28   0.052    -.0146736    2.211737
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.413    -.6114001     .278203
       _cons |   2.970853   1.207168     2.46   0.039     .1871188    5.754586
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, i2
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Approximate confidence intervals for between-studies SDs and I^2:
------------------------------------------------------------------------------
Variable         SD        [95% Conf. Interval]   I^2     [95% Conf. Interval]
------------------------------------------------------------------------------
z1              .48321592  .13562662  .83080522      62       11         83
z2              1.6110678  .65874106  2.5633946      88       54         95
------------------------------------------------------------------------------
Note: I^2 computed from estimated between-studies variance
      and typical within-studies variances
Note: CIs computed on SD scale

Between-study correlations:
-------------------------------------------------
Variables       Correl.    [95% Conf. Interval]
-------------------------------------------------
z1 & z2         -1         .          .
-------------------------------------------------
Note: CI computed on log((1+corr)/(1-corr)) scale


mvmeta z S study, pbest(min, seed(641))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws
- allowing for parameter uncertainty
----------------------
_id and   | Treatment 
Rank      |   z1    z2
----------+-----------
1         |
     Best | 90.8   9.2
    Worst |  9.2  90.8
----------+-----------
2         |
     Best | 91.9   8.1
    Worst |  8.1  91.9
----------+-----------
3         |
     Best | 92.7   7.3
    Worst |  7.3  92.7
----------+-----------
4         |
     Best | 92.9   7.1
    Worst |  7.1  92.9
----------+-----------
5         |
     Best | 91.7   8.3
    Worst |  8.3  91.7
----------+-----------
6         |
     Best | 87.5  12.5
    Worst | 12.5  87.5
----------+-----------
7         |
     Best | 80.1  19.9
    Worst | 19.9  80.1
----------+-----------
8         |
     Best | 70.9  29.1
    Worst | 29.1  70.9
----------+-----------
9         |
     Best | 60.7  39.3
    Worst | 39.3  60.7
----------+-----------
10        |
     Best | 53.0  47.0
    Worst | 47.0  53.0
----------------------


mvmeta z S study, pbest(min in 2/5, all gen(rank) zero predict saving(z) replac
> e mcse id(study) seed(641))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------
(file z.dta not found)

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws (written to file z.dta)
- allowing for parameter uncertainty and between-studies variation
- figures are estimated probability (upper), Monte Carlo error (lower)
----------------------------
study and |    Treatment    
Rank      | zero    z1    z2
----------+-----------------
2         |
     Best | 89.7   3.1   7.2
          |  1.0   0.5   0.8
          | 
      2nd | 10.3  70.8  18.9
          |  1.0   1.4   1.2
          | 
    Worst |  0.0  26.1  73.9
          |  0.0   1.4   1.4
----------+-----------------
3         |
     Best | 90.0   2.1   7.9
          |  0.9   0.5   0.9
          | 
      2nd | 10.0  70.5  19.5
          |  0.9   1.4   1.3
          | 
    Worst |  0.0  27.4  72.6
          |  0.0   1.4   1.4
----------+-----------------
4         |
     Best | 89.4   1.7   8.9
          |  1.0   0.4   0.9
          | 
      2nd | 10.6  68.1  21.3
          |  1.0   1.5   1.3
          | 
    Worst |  0.0  30.2  69.8
          |  0.0   1.5   1.5
----------+-----------------
5         |
     Best | 88.4   1.4  10.2
          |  1.0   0.4   1.0
          | 
      2nd | 11.6  65.7  22.7
          |  1.0   1.5   1.3
          | 
    Worst |  0.0  32.9  67.1
          |  0.0   1.5   1.5
----------------------------


mvmeta z S study, nowt
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, wt(sd details format(%5.3f) keepmat(SD) unscaled wide)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study    _cons    study    _cons
       1   24.157   33.466   21.487   29.937
       2   11.460   18.584   15.259   24.379
       3   10.184   20.135    9.082   18.190
       4    2.400    7.802    2.958    9.117
       5    0.220    3.979    0.310    3.475
       6    0.660    0.689    0.287    1.132
       7    4.375    0.120    2.000    0.001
       8    8.023    1.414    7.106    0.850
       9   11.478    3.367   14.924    3.754
      10   27.045   10.445   26.588    9.166
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    3.467    4.010    1.460    1.663
  DIRECT   96.533   95.990   98.540   98.337

Details of unscaled weights:
-------------------------------------------------------------------------------
      |                          source and parameter                          
      | -------------- TOTAL -------------- ------------- BORROWED ------------
   id | z1:study z1:_cons z2:study z2:_cons z1:study z1:_cons z2:study z2:_cons
------+------------------------------------------------------------------------
    1 |    0.001    0.061    0.008    0.430    0.000    0.000    0.000    0.012
    2 |    0.001    0.034    0.006    0.350    0.000    0.003    0.000    0.000
    3 |    0.001    0.037    0.003    0.261    0.000    0.003    0.000    0.009
    4 |    0.000    0.014    0.001    0.131    0.000    0.000    0.000    0.000
    5 |    0.000    0.007    0.000    0.050    0.000    0.000    0.000    0.002
    6 |    0.000    0.001    0.000    0.016    0.000    0.000    0.000    0.000
    7 |    0.000    0.000    0.001    0.000    0.000    0.000    0.000    0.000
    8 |    0.000    0.003    0.003    0.012    0.000    0.000    0.000    0.000
    9 |    0.001    0.006    0.005    0.054    0.000    0.000    0.000    0.000
   10 |    0.001    0.019    0.010    0.132    0.000    0.000    0.000    0.001
      | 
Total |    0.005    0.183    0.037    1.436    0.000    0.007    0.001    0.024
-------------------------------------------------------------------------------

-------------------------------------------
      |        source and parameter        
      | -------------- DIRECT -------------
   id | z1:study z1:_cons z2:study z2:_cons
------+------------------------------------
    1 |    0.001    0.061    0.008    0.418
    2 |    0.001    0.031    0.006    0.350
    3 |    0.000    0.034    0.003    0.253
    4 |    0.000    0.014    0.001    0.131
    5 |    0.000    0.007    0.000    0.048
    6 |    0.000    0.001    0.000    0.016
    7 |    0.000    0.000    0.001    0.000
    8 |    0.000    0.003    0.003    0.012
    9 |    0.001    0.006    0.005    0.054
   10 |    0.001    0.019    0.010    0.131
      | 
Total |    0.005    0.176    0.036    1.412
-------------------------------------------
-----------------------------------------------------------------------


mvmeta z S study, wt(rv details format(%5.3f) keepmat(RV))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Weights using relative variances method
Borrowing of strength (% of total for each parameter)
-----------------------------------------------------
               z1:      z1:      z2:      z2:
            study    _cons    study    _cons
   TOTAL  100.000  100.000  100.000  100.000
BORROWED   22.001   26.358   -6.821   -6.774
  DIRECT   77.999   73.642  106.821  106.774

Standard errors used in the relative variance method:
                     z1:        z1:        z2:        z2:
                  study      _cons      study      _cons
  Univariate  .08850026  .56253764  .18662819  1.1682476
Multivariate   .0781606  .48274209  .19288845  1.2071677
-----------------------------------------------------


mvmeta z S study, wt(dpc details format(%5.3f) keepmat(DPC))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Weights using data-point coefficients method
Coefficients for parameters by data points
----------------------------------------------------------------------
           z1:     z1:     z2:     z2:
        study   _cons   study   _cons
 1:z1  -0.055   0.381   0.032  -0.230
 1:z2   0.000  -0.006  -0.039   0.290
 2:z1  -0.024   0.178   0.000   0.002
 2:z2   0.005  -0.042  -0.043   0.341
 3:z1  -0.060   0.496  -0.035   0.326
 3:z2  -0.008   0.065  -0.045   0.401
 4:z1  -0.016   0.173  -0.002   0.027
 4:z2   0.001  -0.009  -0.020   0.218
 5:z1  -0.005   0.166   0.006  -0.110
 5:z2   0.000   0.006  -0.004   0.092
 6:z1   0.013   0.037   0.003   0.034
 6:z2   0.002  -0.009   0.007   0.085
 7:z1   0.030  -0.033  -0.024   0.002
 7:z2   0.002  -0.006   0.008   0.002
 8:z1   0.031  -0.085  -0.003   0.014
 8:z2   0.000  -0.005   0.028  -0.059
 9:z1   0.023  -0.077   0.002  -0.001
 9:z2  -0.005   0.015   0.044  -0.135
10:z1   0.063  -0.237   0.021  -0.063
10:z2   0.002  -0.010   0.065  -0.234
----------------------------------------------------------------------


mvmeta z S study, testsigma
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Restricted likelihood ratio test for heterogeneity: LRT =  52.47 (d.f. = 3) P =
>  0.000
P-value halved: see help j_chibar


mvmeta z S study, qscalar
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Scalar Q test for heterogeneity: Q =  83.14 (d.f. = 15) P = 0.000


mvmeta z S study, randfix
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Multivariate R statistic
Measures ratio of std errors in current vs. fixed-effect analysis
------------------------------------------------------------------------------
Outcomes considered                             z1 z2
Number of parameters                            4
Sqrt determinant of variance (reml)             .00091145
                             (fixed)            .00006951
R statistic = ratio ^ (1/4)                     1.9029116
------------------------------------------------------------------------------


mvmeta z S study, randfix(z*)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Multivariate R statistic
Measures ratio of std errors in current vs. fixed-effect analysis
------------------------------------------------------------------------------
Outcomes considered                             z1 z2
Number of parameters                            4
Sqrt determinant of variance (reml)             .00091145
                             (fixed)            .00006951
R statistic = ratio ^ (1/4)                     1.9029116
------------------------------------------------------------------------------


mvmeta z S study, bubble(name(bubble,replace) yline(0) xline(0)         col(blu
> e green black =) lwidth(.2 = = .6) lpatt(solid = dash solid))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------
Warning: bubble plot can't show summaries - last mvmeta run had covariates
1 missing values found for z1 and displayed at z1=0


mvmeta z S study, pi
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    95% Confidence Int.     95% Prediction Int.
z1           1.098532    .1523746    2.044689   -.4765511    2.673614
z2           2.970853    .6048473    5.336858   -1.671491    7.613196
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom


mvmeta z S study, pi(format(%9.5f) level(80))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    80% Confidence Int.     80% Prediction Int.
z1            1.09853     0.47987     1.71719     0.14446     2.05261
z2            2.97085     1.42380     4.51790     0.15885     5.78286
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom

. 
. // and ID options
. dicmd mvmeta z S study, `wtsd' id(studychar) pbest(min, seed(641))


mvmeta z S study, wt(sd details format(%5.3f) keepmat(SD) unscaled wide) id(stu
> dychar) pbest(min, seed(641))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study    _cons    study    _cons
 Study 1   24.157   33.466   21.487   29.937
 Study 2   11.460   18.584   15.259   24.379
 Study 3   10.184   20.135    9.082   18.190
 Study 4    2.400    7.802    2.958    9.117
 Study 5    0.220    3.979    0.310    3.475
 Study 6    0.660    0.689    0.287    1.132
 Study 7    4.375    0.120    2.000    0.001
 Study 8    8.023    1.414    7.106    0.850
 Study 9   11.478    3.367   14.924    3.754
Study 10   27.045   10.445   26.588    9.166
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    3.467    4.010    1.460    1.663
  DIRECT   96.533   95.990   98.540   98.337

Details of unscaled weights:
--------------------------------------------------
          |          source and parameter         
          | ---------------- TOTAL ---------------
       id | z1:study  z1:_cons  z2:study  z2:_cons
----------+---------------------------------------
  Study 1 |    0.001     0.061     0.008     0.430
  Study 2 |    0.001     0.034     0.006     0.350
  Study 3 |    0.001     0.037     0.003     0.261
  Study 4 |    0.000     0.014     0.001     0.131
  Study 5 |    0.000     0.007     0.000     0.050
  Study 6 |    0.000     0.001     0.000     0.016
  Study 7 |    0.000     0.000     0.001     0.000
  Study 8 |    0.000     0.003     0.003     0.012
  Study 9 |    0.001     0.006     0.005     0.054
 Study 10 |    0.001     0.019     0.010     0.132
          | 
    Total |    0.005     0.183     0.037     1.436
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | -------------- BORROWED --------------
       id | z1:study  z1:_cons  z2:study  z2:_cons
----------+---------------------------------------
  Study 1 |    0.000     0.000     0.000     0.012
  Study 2 |    0.000     0.003     0.000     0.000
  Study 3 |    0.000     0.003     0.000     0.009
  Study 4 |    0.000     0.000     0.000     0.000
  Study 5 |    0.000     0.000     0.000     0.002
  Study 6 |    0.000     0.000     0.000     0.000
  Study 7 |    0.000     0.000     0.000     0.000
  Study 8 |    0.000     0.000     0.000     0.000
  Study 9 |    0.000     0.000     0.000     0.000
 Study 10 |    0.000     0.000     0.000     0.001
          | 
    Total |    0.000     0.007     0.001     0.024
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | --------------- DIRECT ---------------
       id | z1:study  z1:_cons  z2:study  z2:_cons
----------+---------------------------------------
  Study 1 |    0.001     0.061     0.008     0.418
  Study 2 |    0.001     0.031     0.006     0.350
  Study 3 |    0.000     0.034     0.003     0.253
  Study 4 |    0.000     0.014     0.001     0.131
  Study 5 |    0.000     0.007     0.000     0.048
  Study 6 |    0.000     0.001     0.000     0.016
  Study 7 |    0.000     0.000     0.001     0.000
  Study 8 |    0.000     0.003     0.003     0.012
  Study 9 |    0.001     0.006     0.005     0.054
 Study 10 |    0.001     0.019     0.010     0.131
          | 
    Total |    0.005     0.176     0.036     1.412
--------------------------------------------------
-----------------------------------------------------------------------

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws
- allowing for parameter uncertainty
----------------------
studychar | Treatment 
and Rank  |   z1    z2
----------+-----------
Study 1   |
     Best | 90.8   9.2
    Worst |  9.2  90.8
----------+-----------
Study 2   |
     Best | 91.9   8.1
    Worst |  8.1  91.9
----------+-----------
Study 3   |
     Best | 92.7   7.3
    Worst |  7.3  92.7
----------+-----------
Study 4   |
     Best | 92.9   7.1
    Worst |  7.1  92.9
----------+-----------
Study 5   |
     Best | 91.7   8.3
    Worst |  8.3  91.7
----------+-----------
Study 6   |
     Best | 87.5  12.5
    Worst | 12.5  87.5
----------+-----------
Study 7   |
     Best | 80.1  19.9
    Worst | 19.9  80.1
----------+-----------
Study 8   |
     Best | 70.9  29.1
    Worst | 29.1  70.9
----------+-----------
Study 9   |
     Best | 60.7  39.3
    Worst | 39.3  60.7
----------+-----------
Study 10  |
     Best | 53.0  47.0
    Worst | 47.0  53.0
----------------------

. pause 

. 
. // AND ALL TOGETHER
. dicmd mvmeta z S study, `replayoptstog' pi


mvmeta z S study, showall eform(EFORM) nouncertainv print(bscov) level(90)     
> dof(n-2) i2 pbest(min in 2/5, all gen(rank) zero predict saving(z) replace mc
> se id(study) seed(641)) wt(sd details format(%5.3f) keepmat(SD) unscaled wide
> ) testsigma qscalar randfix(z*) bubble(name(bubble,replace) yline(0) xline(0)
>          col(blue green black =) lwidth(.2 = = .6) lpatt(solid = dash solid))
>  forest(title(Forest plot) name(forest,replace)         xli(0) subtitle(,size
> (large))         xlab(,labsize(large)) ylab(,labsize(large))         xrescale
>  uv(line predict) mv(line predict) weights(align(c)) ytick(none)) pi
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  
(option showall ignored with option nouncertainv)

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
                                               Degrees of freedom      =     8
------------------------------------------------------------------------------
             |      EFORM   Std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.008274   .0783386     0.11   0.918     .8726335    1.164997
       _cons |   2.999758    1.43995     2.29   0.051      1.22864    7.323992
-------------+----------------------------------------------------------------
z2           |
       study |   .8465394   .1632157    -0.86   0.413     .5914809    1.211584
       _cons |   19.50854   23.51929     2.46   0.039     2.073009    183.5898
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
            z1          z2
z1   .23349763
z2  -.77849362   2.5955395
-------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study    _cons    study    _cons
       1   24.157   33.466   21.487   29.937
       2   11.460   18.584   15.259   24.379
       3   10.184   20.135    9.082   18.190
       4    2.400    7.802    2.958    9.117
       5    0.220    3.979    0.310    3.475
       6    0.660    0.689    0.287    1.132
       7    4.375    0.120    2.000    0.001
       8    8.023    1.414    7.106    0.850
       9   11.478    3.367   14.924    3.754
      10   27.045   10.445   26.588    9.166
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    3.467    4.010    1.460    1.663
  DIRECT   96.533   95.990   98.540   98.337

Details of unscaled weights:
-------------------------------------------------------------------------------
      |                          source and parameter                          
      | -------------- TOTAL -------------- ------------- BORROWED ------------
   id | z1:study z1:_cons z2:study z2:_cons z1:study z1:_cons z2:study z2:_cons
------+------------------------------------------------------------------------
    1 |    0.001    0.061    0.008    0.430    0.000    0.000    0.000    0.012
    2 |    0.001    0.034    0.006    0.350    0.000    0.003    0.000    0.000
    3 |    0.001    0.037    0.003    0.261    0.000    0.003    0.000    0.009
    4 |    0.000    0.014    0.001    0.131    0.000    0.000    0.000    0.000
    5 |    0.000    0.007    0.000    0.050    0.000    0.000    0.000    0.002
    6 |    0.000    0.001    0.000    0.016    0.000    0.000    0.000    0.000
    7 |    0.000    0.000    0.001    0.000    0.000    0.000    0.000    0.000
    8 |    0.000    0.003    0.003    0.012    0.000    0.000    0.000    0.000
    9 |    0.001    0.006    0.005    0.054    0.000    0.000    0.000    0.000
   10 |    0.001    0.019    0.010    0.132    0.000    0.000    0.000    0.001
      | 
Total |    0.005    0.183    0.037    1.436    0.000    0.007    0.001    0.024
-------------------------------------------------------------------------------

-------------------------------------------
      |        source and parameter        
      | -------------- DIRECT -------------
   id | z1:study z1:_cons z2:study z2:_cons
------+------------------------------------
    1 |    0.001    0.061    0.008    0.418
    2 |    0.001    0.031    0.006    0.350
    3 |    0.000    0.034    0.003    0.253
    4 |    0.000    0.014    0.001    0.131
    5 |    0.000    0.007    0.000    0.048
    6 |    0.000    0.001    0.000    0.016
    7 |    0.000    0.000    0.001    0.000
    8 |    0.000    0.003    0.003    0.012
    9 |    0.001    0.006    0.005    0.054
   10 |    0.001    0.019    0.010    0.131
      | 
Total |    0.005    0.176    0.036    1.412
-------------------------------------------
-----------------------------------------------------------------------

Approximate confidence intervals for between-studies SDs and I^2:
------------------------------------------------------------------------------
Variable         SD        [90% Conf. Interval]   I^2     [90% Conf. Interval]
------------------------------------------------------------------------------
z1              .48321592  .19150979  .77492206      62       21         81
z2              1.6110678  .81185001  2.4102856      88       64         94
------------------------------------------------------------------------------
Note: I^2 computed from estimated between-studies variance
      and typical within-studies variances
Note: CIs computed on SD scale

Between-study correlations:
-------------------------------------------------
Variables       Correl.    [90% Conf. Interval]
-------------------------------------------------
z1 & z2         -1         .          .
-------------------------------------------------
Note: CI computed on log((1+corr)/(1-corr)) scale

Restricted likelihood ratio test for heterogeneity: LRT =  52.47 (d.f. = 3) P =
>  0.000
P-value halved: see help j_chibar

Scalar Q test for heterogeneity: Q =  83.14 (d.f. = 15) P = 0.000

Multivariate R statistic
Measures ratio of std errors in current vs. fixed-effect analysis
------------------------------------------------------------------------------
Outcomes considered                             z1 z2
Number of parameters                            4
Sqrt determinant of variance (reml)             .00091145
                             (fixed)            .00006951
R statistic = ratio ^ (1/4)                     1.9029116
------------------------------------------------------------------------------

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws (written to file z.dta)
- allowing for parameter uncertainty and between-studies variation
- figures are estimated probability (upper), Monte Carlo error (lower)
----------------------------
study and |    Treatment    
Rank      | zero    z1    z2
----------+-----------------
2         |
     Best | 89.7   3.1   7.2
          |  1.0   0.5   0.8
          | 
      2nd | 10.3  70.8  18.9
          |  1.0   1.4   1.2
          | 
    Worst |  0.0  26.1  73.9
          |  0.0   1.4   1.4
----------+-----------------
3         |
     Best | 90.0   2.1   7.9
          |  0.9   0.5   0.9
          | 
      2nd | 10.0  70.5  19.5
          |  0.9   1.4   1.3
          | 
    Worst |  0.0  27.4  72.6
          |  0.0   1.4   1.4
----------+-----------------
4         |
     Best | 89.4   1.7   8.9
          |  1.0   0.4   0.9
          | 
      2nd | 10.6  68.1  21.3
          |  1.0   1.5   1.3
          | 
    Worst |  0.0  30.2  69.8
          |  0.0   1.5   1.5
----------+-----------------
5         |
     Best | 88.4   1.4  10.2
          |  1.0   0.4   1.0
          | 
      2nd | 11.6  65.7  22.7
          |  1.0   1.5   1.3
          | 
    Worst |  0.0  32.9  67.1
          |  0.0   1.5   1.5
----------------------------
Warning: bubble plot can't show summaries - last mvmeta run had covariates
1 missing values found for z1 and displayed at z1=0
Sorry, forest plot is not yet available

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    95% Confidence Int.     95% Prediction Int.
z1           1.098532    .1523746    2.044689   -.4765511    2.673614
z2           2.970853    .6048473    5.336858   -1.671491    7.613196
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom

. pause 

. drop rank* 

. 
. // CHECK ESTIMATE OPTIONS ONE BY ONE
. foreach estimateopt in `estimateoptssep' {
  2.     dicmd mvmeta z S study, `estimateopt'
  3. pause 
  4. }


mvmeta z S study, fixed
Note: using method fixed
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12

Multivariate meta-analysis
Variance-covariance matrix = (none)
Method = fixed                                 Number of dimensions    =     2
                                               Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |  -.0199883   .0537306    -0.37   0.710    -.1252984    .0853218
       _cons |   1.237064   .3251131     3.81   0.000     .5998542    1.874274
-------------+----------------------------------------------------------------
z2           |
       study |  -.1659962   .0602807    -2.75   0.006    -.2841442   -.0478482
       _cons |   2.108789   .3701573     5.70   0.000     1.383294    2.834284
------------------------------------------------------------------------------


mvmeta z S study, mm
Note: using method mm2
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = mm2                                   Number of dimensions    =     2
                                               Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0124866    .083085     0.15   0.881     -.150357    .1753301
       _cons |   1.073865   .5160843     2.08   0.037     .0623585    2.085372
-------------+----------------------------------------------------------------
z2           |
       study |  -.1689507   .1889764    -0.89   0.371    -.5393377    .2014363
       _cons |   2.956983   1.182049     2.50   0.012     .6402103    5.273757
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
            SD          z1          z2
z1   .53692823           1           .
z2   1.5738334  -.96967325           1
----------------------------------------------------


mvmeta z S study, mm1
Note: using method mm1
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = mm1                                   Number of dimensions    =     2
                                               Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0119692   .0825468     0.14   0.885    -.1498195    .1737579
       _cons |   1.075728   .5116434     2.10   0.036     .0729256    2.078531
-------------+----------------------------------------------------------------
z2           |
       study |   -.168445   .1889195    -0.89   0.373    -.5387204    .2018303
       _cons |   2.951566   1.181653     2.50   0.012     .6355675    5.267564
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
            SD          z1          z2
z1   .53692823           1           .
z2   1.5738334  -.99261829           1
----------------------------------------------------


mvmeta z S study, mm2
Note: using method mm2
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = mm2                                   Number of dimensions    =     2
                                               Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0124866    .083085     0.15   0.881     -.150357    .1753301
       _cons |   1.073865   .5160843     2.08   0.037     .0623585    2.085372
-------------+----------------------------------------------------------------
z2           |
       study |  -.1689507   .1889764    -0.89   0.371    -.5393377    .2014363
       _cons |   2.956983   1.182049     2.50   0.012     .6402103    5.273757
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
            SD          z1          z2
z1   .53692823           1           .
z2   1.5738334  -.96967325           1
----------------------------------------------------


mvmeta z S study, reml
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, ml
Note: using method ml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood =  -22.92849
rescale:       log likelihood =  -22.92849
rescale eq:    log likelihood = -22.897544
Iteration 0:   log likelihood = -22.897544  
Iteration 1:   log likelihood = -22.732728  
Iteration 2:   log likelihood = -22.686598  
Iteration 3:   log likelihood = -22.686576  
Iteration 4:   log likelihood = -22.686576  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = ml                                    Number of dimensions    =     2
Log likelihood = -22.686576                    Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0077408   .0741682     0.10   0.917    -.1376261    .1531078
       _cons |   1.097437   .4577645     2.40   0.017     .2002346    1.994639
-------------+----------------------------------------------------------------
z2           |
       study |  -.1688183   .1715919    -0.98   0.325    -.5051321    .1674956
       _cons |   2.950435   1.076191     2.74   0.006     .8411403    5.059731
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .42874632          1          .
z2  1.4014507         -1          1
----------------------------------------------------


mvmeta z S study, vars(z2)
Note: using method reml
Note: regressing z2 on study
Note: 10 observations on 1 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -19.018393
rescale:       log likelihood = -19.018393
rescale eq:    log likelihood = -19.018393
Iteration 0:   log likelihood = -19.018393  
Iteration 1:   log likelihood =  -19.01651  
Iteration 2:   log likelihood = -19.016505  
Iteration 3:   log likelihood = -19.016505  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     1
Restricted log likelihood = -19.016505         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z2           |
       study |  -.1812972   .1866282    -0.97   0.331    -.5470817    .1844873
       _cons |   2.968069   1.168248     2.54   0.011     .6783458    5.257792
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z2
z2  1.5447791          1
----------------------------------------------------


mvmeta z S study, start(I(2))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -31.347171
rescale:       log likelihood = -31.347171
rescale eq:    log likelihood = -29.174082
Iteration 0:   log likelihood = -29.174082  
Iteration 1:   log likelihood = -28.983151  
Iteration 2:   log likelihood = -26.752385  (backed up)
Iteration 3:   log likelihood = -26.198993  
Iteration 4:   log likelihood = -26.182726  
Iteration 5:   log likelihood = -26.182666  
Iteration 6:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449525    .1614315
       _cons |   1.098532   .4827422     2.28   0.023     .1523744    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048469    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321593          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, showstart
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

Starting value for beta's:
            z1:         z1:         z2:         z2:
         study       _cons       study       _cons
y1   .01196918   1.0757282  -.16844504   2.9515658

Starting value for Sigma (between-studies variance):
            z1          z2
z1   .28829192
z2  -.83879778   2.4769517

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, longparm
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, wscorr(0)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: wscorr(0) not used
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, wscorr(riley)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Note: using Riley's overall correlation model (ignoring covariances)
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -31.347171
rescale:       log likelihood = -31.347171
rescale eq:    log likelihood = -29.174082
Iteration 0:   log likelihood = -29.174082  (not concave)
Iteration 1:   log likelihood = -26.940187  
Iteration 2:   log likelihood = -26.740183  
Iteration 3:   log likelihood = -26.569745  
Iteration 4:   log likelihood = -26.569116  
Iteration 5:   log likelihood = -26.569116  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.569116         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0140378   .0818228     0.17   0.864     -.146332    .1744076
       _cons |   1.065882   .5084546     2.10   0.036     .0693289    2.062434
-------------+----------------------------------------------------------------
z2           |
       study |   -.146644   .1959493    -0.75   0.454    -.5306977    .2374096
       _cons |   2.881093   1.215687     2.37   0.018     .4983896    5.263796
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
            SD          z1          z2
z1   .49282859           1           .
z2   1.6238089  -.69264249           1
------------------------------------------------------------


mvmeta z S study, mm notrunc
Note: using method mm2
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = mm2                                   Number of dimensions    =     2
                                               Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0124866    .083085     0.15   0.881     -.150357    .1753301
       _cons |   1.073865   .5160843     2.08   0.037     .0623585    2.085372
-------------+----------------------------------------------------------------
z2           |
       study |  -.1689507   .1889764    -0.89   0.371    -.5393377    .2014363
       _cons |   2.956983   1.182049     2.50   0.012     .6402103    5.273757
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
            SD          z1          z2
z1   .53692823           1           .
z2   1.5738334  -.96967325           1
----------------------------------------------------


mvmeta z S study, missest(1)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, missvar(1E5)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, maxse(3)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, noconstant
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -46.526099
rescale:       log likelihood = -46.526099
rescale eq:    log likelihood = -38.294492
Iteration 0:   log likelihood = -38.294492  (not concave)
Iteration 1:   log likelihood = -34.875597  
Iteration 2:   log likelihood = -34.455927  
Iteration 3:   log likelihood = -34.453287  
Iteration 4:   log likelihood = -34.453285  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -34.453285         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .1717799   .0385932     4.45   0.000     .0961386    .2474212
-------------+----------------------------------------------------------------
z2           |
       study |   .2504909   .1105145     2.27   0.023     .0338863    .4670954
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
            SD          z1          z2
z1   .61990638           1           .
z2   2.0327773  -.11100071           1
----------------------------------------------------


mvmeta z S study, psdcrit(1E-3)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, noposdef
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, bscov(uns)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, bscov(prop I(2))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is proportional to I(2)

initial:       log likelihood = -31.347171
rescale:       log likelihood = -31.347171
rescale eq:    log likelihood = -31.347171
Iteration 0:   log likelihood = -31.347171  
Iteration 1:   log likelihood = -31.305113  
Iteration 2:   log likelihood = -31.305105  
Iteration 3:   log likelihood = -31.305105  

Multivariate meta-analysis
Variance-covariance matrix = proportional I(2)
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -31.305105         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0267874   .1510909     0.18   0.859    -.2693453    .3229201
       _cons |   1.027795    .978545     1.05   0.294    -.8901182    2.945708
-------------+----------------------------------------------------------------
z2           |
       study |    -.18456   .1395597    -1.32   0.186    -.4580919    .0889719
       _cons |   2.882977   .8800445     3.28   0.001     1.158122    4.607833
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  1.0727988          1          .
z2  1.0727988          0          1
----------------------------------------------------


mvmeta z S study, bscov(equal I(2))
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12

Multivariate meta-analysis
Variance-covariance matrix = equals I(2)
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -31.347171         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0263726   .1424613     0.19   0.853    -.2528464    .3055915
       _cons |    1.02871   .9217154     1.12   0.264    -.7778193    2.835239
-------------+----------------------------------------------------------------
z2           |
       study |  -.1851243   .1325217    -1.40   0.162     -.444862    .0746134
       _cons |   2.862695   .8342157     3.43   0.001     1.227662    4.497728
------------------------------------------------------------------------------

Specified between-studies SDs and correlation matrix
----------------------------------------------------
    SD  c1  c2
c1   1   1   .
c2   1   0   1
----------------------------------------------------


mvmeta z S study, bscov(corr P2)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is correlation equal to P2

initial:       log likelihood = -33.995223
rescale:       log likelihood = -33.995223
rescale eq:    log likelihood = -31.444598
Iteration 0:   log likelihood = -31.444598  
Iteration 1:   log likelihood =  -31.21539  
Iteration 2:   log likelihood = -31.200501  
Iteration 3:   log likelihood = -31.200458  
Iteration 4:   log likelihood = -31.200458  

Multivariate meta-analysis
Variance-covariance matrix = correlation P2
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -31.200458         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0178046   .0974111     0.18   0.855    -.1731176    .2087269
       _cons |   1.066681   .6191922     1.72   0.085    -.1469132    2.280276
-------------+----------------------------------------------------------------
z2           |
       study |  -.1875168   .2181758    -0.86   0.390    -.6151335    .2400998
       _cons |   2.958431   1.362824     2.17   0.030     .2873445    5.629517
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .61899303          1          .
z2  1.8521612         .5          1
----------------------------------------------------


mvmeta z S study, bscov(exch 0.5)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is proportional to .5*I(2)+.5*J(2,2,1)

initial:       log likelihood = -33.995223
rescale:       log likelihood = -33.995223
rescale eq:    log likelihood = -33.995223
Iteration 0:   log likelihood = -33.995223  
Iteration 1:   log likelihood = -33.431716  
Iteration 2:   log likelihood = -33.430445  
Iteration 3:   log likelihood = -33.430445  

Multivariate meta-analysis
Variance-covariance matrix = proportional .5*I(2)+.5*J(2,2,1)
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -33.430445         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0173818    .175081     0.10   0.921    -.3257705    .3605342
       _cons |    1.10561   1.129952     0.98   0.328    -1.109055    3.320276
-------------+----------------------------------------------------------------
z2           |
       study |  -.1887871   .1621092    -1.16   0.244    -.5065153    .1289412
       _cons |   2.889216   1.018808     2.84   0.005       .89239    4.886043
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  1.3035273          1          .
z2  1.3035273         .5          1
----------------------------------------------------


mvmeta z S study, bscov(exch)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is exchangeable

initial:       log likelihood = -31.347171
rescale:       log likelihood = -31.347171
rescale eq:    log likelihood = -31.347171
Iteration 0:   log likelihood = -31.347171  
Iteration 1:   log likelihood = -30.642363  
Iteration 2:   log likelihood = -30.602324  
Iteration 3:   log likelihood = -30.602303  
Iteration 4:   log likelihood = -30.602303  

Multivariate meta-analysis
Variance-covariance matrix = exchangeable
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -30.602303         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0333604    .146023     0.23   0.819    -.2528394    .3195601
       _cons |   .9696569   .9414159     1.03   0.303    -.8754844    2.814798
-------------+----------------------------------------------------------------
z2           |
       study |  -.1832008   .1371645    -1.34   0.182    -.4520384    .0856368
       _cons |   2.873157   .8657294     3.32   0.001     1.176358    4.569955
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
            SD          z1          z2
z1   1.0502481           1           .
z2   1.0502481  -.48863006           1
----------------------------------------------------


mvmeta z S study, quick
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, commonparm
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at observation 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -27.395433
rescale:       log likelihood = -27.395433
rescale eq:    log likelihood = -27.393653
Iteration 0:   log likelihood = -27.393653  
Iteration 1:   log likelihood = -27.328897  
Iteration 2:   log likelihood = -27.327961  
Iteration 3:   log likelihood =  -27.32796  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -27.32796          Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |  -.0384723    .044461    -0.87   0.387    -.1256144    .0486697
       _cons |   1.572738   .2700849     5.82   0.000     1.043381    2.102095
------------------------------------------------------------------------------
The above coefficients also apply to the following equations:
    z2: study _cons

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48487943          1          .
z2   1.568617         -1          1
----------------------------------------------------


mvmeta z S study, id(study)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at study=1, z1 is missing, so I'm ignoring non-missing S11
Warning: at study=1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, id(studychar)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------


mvmeta z S study, id(studynum)
Note: using method reml
Note: regressing z1 on study
Note: regressing z2 on study
Note: 10 observations on 2 variables
Warning: at studynum=Study 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at studynum=Study 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   .0082395   .0781606     0.11   0.916    -.1449524    .1614315
       _cons |   1.098532   .4827421     2.28   0.023     .1523746    2.044689
-------------+----------------------------------------------------------------
z2           |
       study |  -.1665985   .1928885    -0.86   0.388     -.544653    .2114559
       _cons |   2.970853   1.207168     2.46   0.014     .6048473    5.336858
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         z1         z2
z1  .48321592          1          .
z2  1.6110678         -1          1
----------------------------------------------------

. 
. // CHECK ALL OPTIONS TOGETHER FOR BSCOV(UNS) WSCORR(0)
. dicmd mvmeta z S study one, bscov(uns) wscorr(0) ///
>         `estimateoptstog' `replayoptstog' pi(xvar(one))


mvmeta z S study one, bscov(uns) wscorr(0)         showstart longparm     misse
> st(1) missvar(1E5) maxse(3) noconstant psdcrit(1E-3) id(studychar) showall ef
> orm(EFORM) nouncertainv print(bscov) level(90)     dof(n-2) i2 pbest(min in 2
> /5, all gen(rank) zero predict saving(z) replace mcse id(study) seed(641)) wt
> (sd details format(%5.3f) keepmat(SD) unscaled wide) testsigma qscalar randfi
> x(z*) bubble(name(bubble,replace) yline(0) xline(0)         col(blue green bl
> ack =) lwidth(.2 = = .6) lpatt(solid = dash solid)) forest(title(Forest plot)
>  name(forest,replace)         xli(0) subtitle(,size(large))         xlab(,lab
> size(large)) ylab(,labsize(large))         xrescale uv(line predict) mv(line 
> predict) weights(align(c)) ytick(none)) pi(xvar(one))
Note: using method reml
Note: regressing z1 on study one
Note: regressing z2 on study one
Note: 10 observations on 2 variables
Warning: wscorr(0) not used
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is unstructured

Starting value for beta's:
            z1:         z1:         z2:         z2:
         study         one       study         one
y1   .01196918   1.0757282  -.16844504   2.9515658

Starting value for Sigma (between-studies variance):
            z1          z2
z1   .28829192
z2  -.83879778   2.4769517

initial:       log likelihood = -26.277184
rescale:       log likelihood = -26.277184
rescale eq:    log likelihood = -26.277184
Iteration 0:   log likelihood = -26.277184  
Iteration 1:   log likelihood = -26.198403  
Iteration 2:   log likelihood =  -26.18294  
Iteration 3:   log likelihood = -26.182667  
Iteration 4:   log likelihood = -26.182666  
(option showall ignored with option nouncertainv)

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
                                               Degrees of freedom      =     8
------------------------------------------------------------------------------
             |      EFORM   Std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.008274   .0783386     0.11   0.918     .8726335    1.164997
         one |   2.999758    1.43995     2.29   0.051      1.22864    7.323992
-------------+----------------------------------------------------------------
z2           |
       study |   .8465394   .1632157    -0.86   0.413     .5914809    1.211584
         one |   19.50854   23.51929     2.46   0.039     2.073009    183.5898
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
            z1          z2
z1   .23349763
z2  -.77849362   2.5955395
-------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study      one    study      one
 Study 1   24.157   33.466   21.487   29.937
 Study 2   11.460   18.584   15.259   24.379
 Study 3   10.184   20.135    9.082   18.190
 Study 4    2.400    7.802    2.958    9.117
 Study 5    0.220    3.979    0.310    3.475
 Study 6    0.660    0.689    0.287    1.132
 Study 7    4.375    0.120    2.000    0.001
 Study 8    8.023    1.414    7.106    0.850
 Study 9   11.478    3.367   14.924    3.754
Study 10   27.045   10.445   26.588    9.166
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    3.467    4.010    1.460    1.663
  DIRECT   96.533   95.990   98.540   98.337

Details of unscaled weights:
--------------------------------------------------
          |          source and parameter         
          | ---------------- TOTAL ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.001     0.061     0.008     0.430
  Study 2 |    0.001     0.034     0.006     0.350
  Study 3 |    0.001     0.037     0.003     0.261
  Study 4 |    0.000     0.014     0.001     0.131
  Study 5 |    0.000     0.007     0.000     0.050
  Study 6 |    0.000     0.001     0.000     0.016
  Study 7 |    0.000     0.000     0.001     0.000
  Study 8 |    0.000     0.003     0.003     0.012
  Study 9 |    0.001     0.006     0.005     0.054
 Study 10 |    0.001     0.019     0.010     0.132
          | 
    Total |    0.005     0.183     0.037     1.436
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | -------------- BORROWED --------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.000     0.000     0.000     0.012
  Study 2 |    0.000     0.003     0.000     0.000
  Study 3 |    0.000     0.003     0.000     0.009
  Study 4 |    0.000     0.000     0.000     0.000
  Study 5 |    0.000     0.000     0.000     0.002
  Study 6 |    0.000     0.000     0.000     0.000
  Study 7 |    0.000     0.000     0.000     0.000
  Study 8 |    0.000     0.000     0.000     0.000
  Study 9 |    0.000     0.000     0.000     0.000
 Study 10 |    0.000     0.000     0.000     0.001
          | 
    Total |    0.000     0.007     0.001     0.024
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | --------------- DIRECT ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.001     0.061     0.008     0.418
  Study 2 |    0.001     0.031     0.006     0.350
  Study 3 |    0.000     0.034     0.003     0.253
  Study 4 |    0.000     0.014     0.001     0.131
  Study 5 |    0.000     0.007     0.000     0.048
  Study 6 |    0.000     0.001     0.000     0.016
  Study 7 |    0.000     0.000     0.001     0.000
  Study 8 |    0.000     0.003     0.003     0.012
  Study 9 |    0.001     0.006     0.005     0.054
 Study 10 |    0.001     0.019     0.010     0.131
          | 
    Total |    0.005     0.176     0.036     1.412
--------------------------------------------------
-----------------------------------------------------------------------

Approximate confidence intervals for between-studies SDs and I^2:
------------------------------------------------------------------------------
Variable         SD        [90% Conf. Interval]   I^2     [90% Conf. Interval]
------------------------------------------------------------------------------
z1              .48321592  .19150979  .77492206      62       21         81
z2              1.6110678  .81185001  2.4102856      88       64         94
------------------------------------------------------------------------------
Note: I^2 computed from estimated between-studies variance
      and typical within-studies variances
Note: CIs computed on SD scale

Between-study correlations:
-------------------------------------------------
Variables       Correl.    [90% Conf. Interval]
-------------------------------------------------
z1 & z2         -1         .          .
-------------------------------------------------
Note: CI computed on log((1+corr)/(1-corr)) scale

Restricted likelihood ratio test for heterogeneity: LRT =  52.47 (d.f. = 3) P =
>  0.000
P-value halved: see help j_chibar

Scalar Q test for heterogeneity: Q =  83.14 (d.f. = 15) P = 0.000

Multivariate R statistic
Measures ratio of std errors in current vs. fixed-effect analysis
------------------------------------------------------------------------------
Outcomes considered                             z1 z2
Number of parameters                            4
Sqrt determinant of variance (reml)             .00091145
                             (fixed)            .00006951
R statistic = ratio ^ (1/4)                     1.9029116
------------------------------------------------------------------------------

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws (written to file z.dta)
- allowing for parameter uncertainty and between-studies variation
- figures are estimated probability (upper), Monte Carlo error (lower)
----------------------------
study and |    Treatment    
Rank      | zero    z1    z2
----------+-----------------
2         |
     Best | 89.7   3.1   7.2
          |  1.0   0.5   0.8
          | 
      2nd | 10.3  70.8  18.9
          |  1.0   1.4   1.2
          | 
    Worst |  0.0  26.1  73.9
          |  0.0   1.4   1.4
----------+-----------------
3         |
     Best | 90.0   2.1   7.9
          |  0.9   0.5   0.9
          | 
      2nd | 10.0  70.5  19.5
          |  0.9   1.4   1.3
          | 
    Worst |  0.0  27.4  72.6
          |  0.0   1.4   1.4
----------+-----------------
4         |
     Best | 89.4   1.7   8.9
          |  1.0   0.4   0.9
          | 
      2nd | 10.6  68.1  21.3
          |  1.0   1.5   1.3
          | 
    Worst |  0.0  30.2  69.8
          |  0.0   1.5   1.5
----------+-----------------
5         |
     Best | 88.4   1.4  10.2
          |  1.0   0.4   1.0
          | 
      2nd | 11.6  65.7  22.7
          |  1.0   1.5   1.3
          | 
    Worst |  0.0  32.9  67.1
          |  0.0   1.5   1.5
----------------------------
Warning: bubble plot can't show summaries - last mvmeta run had covariates
1 missing values found for z1 and displayed at z1=0
Sorry, forest plot is not yet available

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    95% Confidence Int.     95% Prediction Int.
z1           1.098532    .1523746    2.044689   -.4765511    2.673614
z2           2.970853    .6048473    5.336858   -1.671491    7.613196
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom

. pause 

. drop rank*

. 
. // ... AND REPLAY
. dicmd mvmeta, `replayoptstog' pi(xvar(one))


mvmeta, showall eform(EFORM) nouncertainv print(bscov) level(90)     dof(n-2) i
> 2 pbest(min in 2/5, all gen(rank) zero predict saving(z) replace mcse id(stud
> y) seed(641)) wt(sd details format(%5.3f) keepmat(SD) unscaled wide) testsigm
> a qscalar randfix(z*) bubble(name(bubble,replace) yline(0) xline(0)         c
> ol(blue green black =) lwidth(.2 = = .6) lpatt(solid = dash solid)) forest(ti
> tle(Forest plot) name(forest,replace)         xli(0) subtitle(,size(large))  
>        xlab(,labsize(large)) ylab(,labsize(large))         xrescale uv(line p
> redict) mv(line predict) weights(align(c)) ytick(none)) pi(xvar(one))
(option showall ignored with option nouncertainv)

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -26.182666         Number of observations  =    10
                                               Degrees of freedom      =     8
------------------------------------------------------------------------------
             |      EFORM   Std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.008274   .0783386     0.11   0.918     .8726335    1.164997
         one |   2.999758    1.43995     2.29   0.051      1.22864    7.323992
-------------+----------------------------------------------------------------
z2           |
       study |   .8465394   .1632157    -0.86   0.413     .5914809    1.211584
         one |   19.50854   23.51929     2.46   0.039     2.073009    183.5898
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
            z1          z2
z1   .23349763
z2  -.77849362   2.5955395
-------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study      one    study      one
 Study 1   24.157   33.466   21.487   29.937
 Study 2   11.460   18.584   15.259   24.379
 Study 3   10.184   20.135    9.082   18.190
 Study 4    2.400    7.802    2.958    9.117
 Study 5    0.220    3.979    0.310    3.475
 Study 6    0.660    0.689    0.287    1.132
 Study 7    4.375    0.120    2.000    0.001
 Study 8    8.023    1.414    7.106    0.850
 Study 9   11.478    3.367   14.924    3.754
Study 10   27.045   10.445   26.588    9.166
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    3.467    4.010    1.460    1.663
  DIRECT   96.533   95.990   98.540   98.337

Details of unscaled weights:
--------------------------------------------------
          |          source and parameter         
          | ---------------- TOTAL ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.001     0.061     0.008     0.430
  Study 2 |    0.001     0.034     0.006     0.350
  Study 3 |    0.001     0.037     0.003     0.261
  Study 4 |    0.000     0.014     0.001     0.131
  Study 5 |    0.000     0.007     0.000     0.050
  Study 6 |    0.000     0.001     0.000     0.016
  Study 7 |    0.000     0.000     0.001     0.000
  Study 8 |    0.000     0.003     0.003     0.012
  Study 9 |    0.001     0.006     0.005     0.054
 Study 10 |    0.001     0.019     0.010     0.132
          | 
    Total |    0.005     0.183     0.037     1.436
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | -------------- BORROWED --------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.000     0.000     0.000     0.012
  Study 2 |    0.000     0.003     0.000     0.000
  Study 3 |    0.000     0.003     0.000     0.009
  Study 4 |    0.000     0.000     0.000     0.000
  Study 5 |    0.000     0.000     0.000     0.002
  Study 6 |    0.000     0.000     0.000     0.000
  Study 7 |    0.000     0.000     0.000     0.000
  Study 8 |    0.000     0.000     0.000     0.000
  Study 9 |    0.000     0.000     0.000     0.000
 Study 10 |    0.000     0.000     0.000     0.001
          | 
    Total |    0.000     0.007     0.001     0.024
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | --------------- DIRECT ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.001     0.061     0.008     0.418
  Study 2 |    0.001     0.031     0.006     0.350
  Study 3 |    0.000     0.034     0.003     0.253
  Study 4 |    0.000     0.014     0.001     0.131
  Study 5 |    0.000     0.007     0.000     0.048
  Study 6 |    0.000     0.001     0.000     0.016
  Study 7 |    0.000     0.000     0.001     0.000
  Study 8 |    0.000     0.003     0.003     0.012
  Study 9 |    0.001     0.006     0.005     0.054
 Study 10 |    0.001     0.019     0.010     0.131
          | 
    Total |    0.005     0.176     0.036     1.412
--------------------------------------------------
-----------------------------------------------------------------------

Approximate confidence intervals for between-studies SDs and I^2:
------------------------------------------------------------------------------
Variable         SD        [90% Conf. Interval]   I^2     [90% Conf. Interval]
------------------------------------------------------------------------------
z1              .48321592  .19150979  .77492206      62       21         81
z2              1.6110678  .81185001  2.4102856      88       64         94
------------------------------------------------------------------------------
Note: I^2 computed from estimated between-studies variance
      and typical within-studies variances
Note: CIs computed on SD scale

Between-study correlations:
-------------------------------------------------
Variables       Correl.    [90% Conf. Interval]
-------------------------------------------------
z1 & z2         -1         .          .
-------------------------------------------------
Note: CI computed on log((1+corr)/(1-corr)) scale

Restricted likelihood ratio test for heterogeneity: LRT =  52.47 (d.f. = 3) P =
>  0.000
P-value halved: see help j_chibar

Scalar Q test for heterogeneity: Q =  83.14 (d.f. = 15) P = 0.000

Multivariate R statistic
Measures ratio of std errors in current vs. fixed-effect analysis
------------------------------------------------------------------------------
Outcomes considered                             z1 z2
Number of parameters                            4
Sqrt determinant of variance (reml)             .00091145
                             (fixed)            .00006951
R statistic = ratio ^ (1/4)                     1.9029116
------------------------------------------------------------------------------

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws (written to file z.dta)
- allowing for parameter uncertainty and between-studies variation
- figures are estimated probability (upper), Monte Carlo error (lower)
----------------------------
study and |    Treatment    
Rank      | zero    z1    z2
----------+-----------------
2         |
     Best | 89.7   3.1   7.2
          |  1.0   0.5   0.8
          | 
      2nd | 10.3  70.8  18.9
          |  1.0   1.4   1.2
          | 
    Worst |  0.0  26.1  73.9
          |  0.0   1.4   1.4
----------+-----------------
3         |
     Best | 90.0   2.1   7.9
          |  0.9   0.5   0.9
          | 
      2nd | 10.0  70.5  19.5
          |  0.9   1.4   1.3
          | 
    Worst |  0.0  27.4  72.6
          |  0.0   1.4   1.4
----------+-----------------
4         |
     Best | 89.4   1.7   8.9
          |  1.0   0.4   0.9
          | 
      2nd | 10.6  68.1  21.3
          |  1.0   1.5   1.3
          | 
    Worst |  0.0  30.2  69.8
          |  0.0   1.5   1.5
----------+-----------------
5         |
     Best | 88.4   1.4  10.2
          |  1.0   0.4   1.0
          | 
      2nd | 11.6  65.7  22.7
          |  1.0   1.5   1.3
          | 
    Worst |  0.0  32.9  67.1
          |  0.0   1.5   1.5
----------------------------
Bubble option: using data from last mvmeta run
Warning: bubble plot can't show summaries - last mvmeta run had covariates
1 missing values found for z1 and displayed at z1=0
Sorry, forest plot is not yet available

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    95% Confidence Int.     95% Prediction Int.
z1           1.098532    .1523746    2.044689   -.4765511    2.673614
z2           2.970853    .6048473    5.336858   -1.671491    7.613196
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom

. pause 

. drop rank* 

. 
. // CHECK ALL OPTIONS TOGETHER FOR BSCOV(EXCH) CORR(RILEY)
. dicmd mvmeta z S study one, bscov(exch 0.5) wscorr(riley) ///
>         `estimateoptstog' `replayoptstog' pi(xvar(one))


mvmeta z S study one, bscov(exch 0.5) wscorr(riley)         showstart longparm 
>     missest(1) missvar(1E5) maxse(3) noconstant psdcrit(1E-3) id(studychar) s
> howall eform(EFORM) nouncertainv print(bscov) level(90)     dof(n-2) i2 pbest
> (min in 2/5, all gen(rank) zero predict saving(z) replace mcse id(study) seed
> (641)) wt(sd details format(%5.3f) keepmat(SD) unscaled wide) testsigma qscal
> ar randfix(z*) bubble(name(bubble,replace) yline(0) xline(0)         col(blue
>  green black =) lwidth(.2 = = .6) lpatt(solid = dash solid)) forest(title(For
> est plot) name(forest,replace)         xli(0) subtitle(,size(large))         
> xlab(,labsize(large)) ylab(,labsize(large))         xrescale uv(line predict)
>  mv(line predict) weights(align(c)) ytick(none)) pi(xvar(one))
Note: using method reml
Note: regressing z1 on study one
Note: regressing z2 on study one
Note: 10 observations on 2 variables
Note: using Riley's overall correlation model (ignoring covariances)
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S11
Note: variance-covariance matrix is proportional to .5*I(2)+.5*J(2,2,1)

Starting value for beta's:
            z1:         z1:         z2:         z2:
         study         one       study         one
y1   .01024541   1.0401901  -.19140923   2.8108557

Starting value for Sigma (between-studies variance):
    c1  c2
r1   1
r2  .5   1

initial:       log likelihood = -35.690612
rescale:       log likelihood = -35.690612
rescale eq:    log likelihood = -35.002595
Iteration 0:   log likelihood = -35.002595  
Iteration 1:   log likelihood = -34.075438  
Iteration 2:   log likelihood = -34.026289  
Iteration 3:   log likelihood = -34.026283  
Iteration 4:   log likelihood = -34.026283  
(option showall ignored with option nouncertainv)
Option i2 is not available with wscorr(riley)
Option qscalar is not available with wscorr(riley)
Option testsigma is not available with wscorr(riley)

Multivariate meta-analysis
Variance-covariance matrix = proportional .5*I(2)+.5*J(2,2,1)
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -34.026283         Number of observations  =    10
                                               Degrees of freedom      =     8
------------------------------------------------------------------------------
             |      EFORM   Std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.012171   .1954303     0.06   0.952     .7068441    1.449385
         one |    2.92203   3.637308     0.86   0.414     .2886719    29.57773
-------------+----------------------------------------------------------------
z2           |
       study |   .8300496   .1482264    -1.04   0.327     .5955088    1.156964
         one |   18.72477   20.92821     2.62   0.031     2.343104    149.6379
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
           z1         z2
z1  2.1502571
z2  1.0751286  2.1502571
-------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study      one    study      one
 Study 1   24.833   34.606   20.699   28.900
 Study 2   14.067   22.519   15.561   24.921
 Study 3    7.900   15.882    9.204   18.418
 Study 4    2.699    8.522    3.049    9.405
 Study 5    0.292    3.874    0.300    3.379
 Study 6    0.342    0.907    0.279    1.201
 Study 7    3.016    0.003    1.650    0.003
 Study 8    7.733    1.038    7.096    0.813
 Study 9   13.898    3.673   15.113    3.729
Study 10   25.221    8.977   27.050    9.231
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    0.185    0.158    0.184    0.158
  DIRECT   99.815   99.842   99.816   99.842

Details of unscaled weights:
--------------------------------------------------
          |          source and parameter         
          | ---------------- TOTAL ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.007     0.377     0.007     0.361
  Study 2 |    0.004     0.245     0.005     0.311
  Study 3 |    0.002     0.173     0.003     0.230
  Study 4 |    0.001     0.093     0.001     0.117
  Study 5 |    0.000     0.042     0.000     0.042
  Study 6 |    0.000     0.010     0.000     0.015
  Study 7 |    0.001     0.000     0.001     0.000
  Study 8 |    0.002     0.011     0.002     0.010
  Study 9 |    0.004     0.040     0.005     0.047
 Study 10 |    0.007     0.098     0.009     0.115
          | 
    Total |    0.029     1.090     0.032     1.248
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | -------------- BORROWED --------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.000     0.001     0.000     0.001
  Study 2 |    0.000     0.000     0.000     0.000
  Study 3 |    0.000     0.000     0.000     0.000
  Study 4 |    0.000     0.000     0.000     0.000
  Study 5 |    0.000     0.000     0.000     0.000
  Study 6 |    0.000     0.000     0.000     0.000
  Study 7 |    0.000     0.000     0.000     0.000
  Study 8 |    0.000     0.000     0.000     0.000
  Study 9 |    0.000     0.000     0.000     0.000
 Study 10 |    0.000     0.000     0.000     0.000
          | 
    Total |    0.000     0.002     0.000     0.002
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | --------------- DIRECT ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.007     0.376     0.007     0.360
  Study 2 |    0.004     0.245     0.005     0.311
  Study 3 |    0.002     0.173     0.003     0.229
  Study 4 |    0.001     0.093     0.001     0.117
  Study 5 |    0.000     0.042     0.000     0.042
  Study 6 |    0.000     0.010     0.000     0.015
  Study 7 |    0.001     0.000     0.001     0.000
  Study 8 |    0.002     0.011     0.002     0.010
  Study 9 |    0.004     0.040     0.005     0.046
 Study 10 |    0.007     0.098     0.009     0.115
          | 
    Total |    0.029     1.088     0.032     1.246
--------------------------------------------------
-----------------------------------------------------------------------
option randfix ignored - mvmeta didn't estimate the fixed-effect model

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws (written to file z.dta)
- allowing for parameter uncertainty and between-studies variation
- figures are estimated probability (upper), Monte Carlo error (lower)
----------------------------
study and |    Treatment    
Rank      | zero    z1    z2
----------+-----------------
2         |
     Best | 71.6  24.4   4.0
          |  1.4   1.4   0.6
          | 
      2nd | 24.3  56.0  19.7
          |  1.4   1.6   1.3
          | 
    Worst |  4.1  19.6  76.3
          |  0.6   1.3   1.3
----------+-----------------
3         |
     Best | 72.4  23.0   4.6
          |  1.4   1.3   0.7
          | 
      2nd | 23.0  55.5  21.5
          |  1.3   1.6   1.3
          | 
    Worst |  4.6  21.5  73.9
          |  0.7   1.3   1.4
----------+-----------------
4         |
     Best | 73.3  21.6   5.1
          |  1.4   1.3   0.7
          | 
      2nd | 22.0  54.7  23.3
          |  1.3   1.6   1.3
          | 
    Worst |  4.7  23.7  71.6
          |  0.7   1.3   1.4
----------+-----------------
5         |
     Best | 73.2  20.4   6.4
          |  1.4   1.3   0.8
          | 
      2nd | 21.7  52.9  25.4
          |  1.3   1.6   1.4
          | 
    Worst |  5.1  26.7  68.2
          |  0.7   1.4   1.5
----------------------------
Warning: bubble plot can't show summaries - last mvmeta run had covariates
1 missing values found for z1 and displayed at z1=0
Sorry, forest plot is not yet available

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    95% Confidence Int.     95% Prediction Int.
z1           1.072279   -1.367654    3.512212   -3.363409    5.507966
z2           2.929847     .736648    5.123047   -1.323726     7.18342
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom

. pause 

. drop rank* 

. 
. // ... AND REPLAY
. dicmd mvmeta, `replayoptstog' pi(xvar(one))


mvmeta, showall eform(EFORM) nouncertainv print(bscov) level(90)     dof(n-2) i
> 2 pbest(min in 2/5, all gen(rank) zero predict saving(z) replace mcse id(stud
> y) seed(641)) wt(sd details format(%5.3f) keepmat(SD) unscaled wide) testsigm
> a qscalar randfix(z*) bubble(name(bubble,replace) yline(0) xline(0)         c
> ol(blue green black =) lwidth(.2 = = .6) lpatt(solid = dash solid)) forest(ti
> tle(Forest plot) name(forest,replace)         xli(0) subtitle(,size(large))  
>        xlab(,labsize(large)) ylab(,labsize(large))         xrescale uv(line p
> redict) mv(line predict) weights(align(c)) ytick(none)) pi(xvar(one))
(option showall ignored with option nouncertainv)
Option i2 is not available with wscorr(riley)
Option qscalar is not available with wscorr(riley)
Option testsigma is not available with wscorr(riley)

Multivariate meta-analysis
Variance-covariance matrix = proportional .5*I(2)+.5*J(2,2,1)
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -34.026283         Number of observations  =    10
                                               Degrees of freedom      =     8
------------------------------------------------------------------------------
             |      EFORM   Std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.012171   .1954303     0.06   0.952     .7068441    1.449385
         one |    2.92203   3.637308     0.86   0.414     .2886719    29.57773
-------------+----------------------------------------------------------------
z2           |
       study |   .8300496   .1482264    -1.04   0.327     .5955088    1.156964
         one |   18.72477   20.92821     2.62   0.031     2.343104    149.6379
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
           z1         z2
z1  2.1502571
z2  1.0751286  2.1502571
-------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study      one    study      one
 Study 1   24.833   34.606   20.699   28.900
 Study 2   14.067   22.519   15.561   24.921
 Study 3    7.900   15.882    9.204   18.418
 Study 4    2.699    8.522    3.049    9.405
 Study 5    0.292    3.874    0.300    3.379
 Study 6    0.342    0.907    0.279    1.201
 Study 7    3.016    0.003    1.650    0.003
 Study 8    7.733    1.038    7.096    0.813
 Study 9   13.898    3.673   15.113    3.729
Study 10   25.221    8.977   27.050    9.231
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    0.185    0.158    0.184    0.158
  DIRECT   99.815   99.842   99.816   99.842

Details of unscaled weights:
--------------------------------------------------
          |          source and parameter         
          | ---------------- TOTAL ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.007     0.377     0.007     0.361
  Study 2 |    0.004     0.245     0.005     0.311
  Study 3 |    0.002     0.173     0.003     0.230
  Study 4 |    0.001     0.093     0.001     0.117
  Study 5 |    0.000     0.042     0.000     0.042
  Study 6 |    0.000     0.010     0.000     0.015
  Study 7 |    0.001     0.000     0.001     0.000
  Study 8 |    0.002     0.011     0.002     0.010
  Study 9 |    0.004     0.040     0.005     0.047
 Study 10 |    0.007     0.098     0.009     0.115
          | 
    Total |    0.029     1.090     0.032     1.248
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | -------------- BORROWED --------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.000     0.001     0.000     0.001
  Study 2 |    0.000     0.000     0.000     0.000
  Study 3 |    0.000     0.000     0.000     0.000
  Study 4 |    0.000     0.000     0.000     0.000
  Study 5 |    0.000     0.000     0.000     0.000
  Study 6 |    0.000     0.000     0.000     0.000
  Study 7 |    0.000     0.000     0.000     0.000
  Study 8 |    0.000     0.000     0.000     0.000
  Study 9 |    0.000     0.000     0.000     0.000
 Study 10 |    0.000     0.000     0.000     0.000
          | 
    Total |    0.000     0.002     0.000     0.002
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | --------------- DIRECT ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.007     0.376     0.007     0.360
  Study 2 |    0.004     0.245     0.005     0.311
  Study 3 |    0.002     0.173     0.003     0.229
  Study 4 |    0.001     0.093     0.001     0.117
  Study 5 |    0.000     0.042     0.000     0.042
  Study 6 |    0.000     0.010     0.000     0.015
  Study 7 |    0.001     0.000     0.001     0.000
  Study 8 |    0.002     0.011     0.002     0.010
  Study 9 |    0.004     0.040     0.005     0.046
 Study 10 |    0.007     0.098     0.009     0.115
          | 
    Total |    0.029     1.088     0.032     1.246
--------------------------------------------------
-----------------------------------------------------------------------
option randfix ignored - mvmeta didn't estimate the fixed-effect model

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws (written to file z.dta)
- allowing for parameter uncertainty and between-studies variation
- figures are estimated probability (upper), Monte Carlo error (lower)
----------------------------
study and |    Treatment    
Rank      | zero    z1    z2
----------+-----------------
2         |
     Best | 71.6  24.4   4.0
          |  1.4   1.4   0.6
          | 
      2nd | 24.3  56.0  19.7
          |  1.4   1.6   1.3
          | 
    Worst |  4.1  19.6  76.3
          |  0.6   1.3   1.3
----------+-----------------
3         |
     Best | 72.4  23.0   4.6
          |  1.4   1.3   0.7
          | 
      2nd | 23.0  55.5  21.5
          |  1.3   1.6   1.3
          | 
    Worst |  4.6  21.5  73.9
          |  0.7   1.3   1.4
----------+-----------------
4         |
     Best | 73.3  21.6   5.1
          |  1.4   1.3   0.7
          | 
      2nd | 22.0  54.7  23.3
          |  1.3   1.6   1.3
          | 
    Worst |  4.7  23.7  71.6
          |  0.7   1.3   1.4
----------+-----------------
5         |
     Best | 73.2  20.4   6.4
          |  1.4   1.3   0.8
          | 
      2nd | 21.7  52.9  25.4
          |  1.3   1.6   1.4
          | 
    Worst |  5.1  26.7  68.2
          |  0.7   1.4   1.5
----------------------------
Bubble option: using data from last mvmeta run
Warning: bubble plot can't show summaries - last mvmeta run had covariates
1 missing values found for z1 and displayed at z1=0
Sorry, forest plot is not yet available

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    95% Confidence Int.     95% Prediction Int.
z1           1.072279   -1.367654    3.512212   -3.363409    5.507966
z2           2.929847     .736648    5.123047   -1.323726     7.18342
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom

. pause 

. drop rank* 

. 
. // CHECK ALL OPTIONS TOGETHER FOR BSCOV(CORR) 
. dicmd mvmeta z S study one, bscov(corr I(2)) ///
>         `estimateoptstog' `replayoptstog' pi(xvar(one))


mvmeta z S study one, bscov(corr I(2))         showstart longparm     missest(1
> ) missvar(1E5) maxse(3) noconstant psdcrit(1E-3) id(studychar) showall eform(
> EFORM) nouncertainv print(bscov) level(90)     dof(n-2) i2 pbest(min in 2/5, 
> all gen(rank) zero predict saving(z) replace mcse id(study) seed(641)) wt(sd 
> details format(%5.3f) keepmat(SD) unscaled wide) testsigma qscalar randfix(z*
> ) bubble(name(bubble,replace) yline(0) xline(0)         col(blue green black 
> =) lwidth(.2 = = .6) lpatt(solid = dash solid)) forest(title(Forest plot) nam
> e(forest,replace)         xli(0) subtitle(,size(large))         xlab(,labsize
> (large)) ylab(,labsize(large))         xrescale uv(line predict) mv(line pred
> ict) weights(align(c)) ytick(none)) pi(xvar(one))
Note: using method reml
Note: regressing z1 on study one
Note: regressing z2 on study one
Note: 10 observations on 2 variables
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is correlation equal to I(2)

Starting value for beta's:
            z1:         z1:         z2:         z2:
         study         one       study         one
y1   .02637256   1.0287097  -.18512429   2.8626951

Starting value for Sigma (between-studies variance):
    c1  c2
c1   1
c2   0   1

initial:       log likelihood = -31.347171
rescale:       log likelihood = -31.347171
rescale eq:    log likelihood = -29.174082
Iteration 0:   log likelihood = -29.174082  
Iteration 1:   log likelihood = -28.791213  
Iteration 2:   log likelihood = -28.787914  
Iteration 3:   log likelihood = -28.787912  
(option showall ignored with option nouncertainv)

Multivariate meta-analysis
Variance-covariance matrix = correlation I(2)
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -28.787912         Number of observations  =    10
                                               Degrees of freedom      =     8
------------------------------------------------------------------------------
             |      EFORM   Std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.018797    .089876     0.21   0.838     .8646568    1.200416
         one |   2.868217   1.611583     1.88   0.098     1.008894    8.154145
-------------+----------------------------------------------------------------
z2           |
       study |   .8341874   .1556658    -0.97   0.360     .5896045    1.180229
         one |   19.45432    22.7007     2.54   0.035      2.22157    170.3617
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
           z1         z2
z1  .26287522
z2          0  2.3863425
-------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study      one    study      one
 Study 1   25.237   34.893   20.942   29.277
 Study 2   11.264   17.882   15.521   24.882
 Study 3    9.506   19.021    9.050   18.144
 Study 4    2.546    8.171    3.020    9.358
 Study 5    0.246    4.138    0.299    3.413
 Study 6    0.520    0.705    0.285    1.181
 Study 7    4.068    0.051    1.663    0.002
 Study 8    8.176    1.378    7.167    0.823
 Study 9   10.932    3.229   15.142    3.739
Study 10   27.504   10.532   26.911    9.182
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    0.000   -0.000    0.000    0.000
  DIRECT  100.000  100.000  100.000  100.000

Details of unscaled weights:
--------------------------------------------------
          |          source and parameter         
          | ---------------- TOTAL ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.001     0.072     0.007     0.399
  Study 2 |    0.001     0.037     0.005     0.339
  Study 3 |    0.001     0.039     0.003     0.247
  Study 4 |    0.000     0.017     0.001     0.127
  Study 5 |    0.000     0.008     0.000     0.046
  Study 6 |    0.000     0.001     0.000     0.016
  Study 7 |    0.000     0.000     0.001     0.000
  Study 8 |    0.000     0.003     0.002     0.011
  Study 9 |    0.001     0.007     0.005     0.051
 Study 10 |    0.002     0.022     0.009     0.125
          | 
    Total |    0.006     0.205     0.035     1.362
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | -------------- BORROWED --------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.000    -0.000    -0.000     0.000
  Study 2 |    0.000     0.000    -0.000    -0.000
  Study 3 |    0.000     0.000     0.000     0.000
  Study 4 |   -0.000    -0.000     0.000     0.000
  Study 5 |   -0.000     0.000    -0.000    -0.000
  Study 6 |   -0.000     0.000     0.000    -0.000
  Study 7 |    0.000     0.000     0.000    -0.000
  Study 8 |   -0.000     0.000    -0.000    -0.000
  Study 9 |    0.000    -0.000     0.000     0.000
 Study 10 |    0.000    -0.000     0.000     0.000
          | 
    Total |    0.000    -0.000     0.000     0.000
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | --------------- DIRECT ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.001     0.072     0.007     0.399
  Study 2 |    0.001     0.037     0.005     0.339
  Study 3 |    0.001     0.039     0.003     0.247
  Study 4 |    0.000     0.017     0.001     0.127
  Study 5 |    0.000     0.008     0.000     0.046
  Study 6 |    0.000     0.001     0.000     0.016
  Study 7 |    0.000     0.000     0.001     0.000
  Study 8 |    0.000     0.003     0.002     0.011
  Study 9 |    0.001     0.007     0.005     0.051
 Study 10 |    0.002     0.022     0.009     0.125
          | 
    Total |    0.006     0.205     0.035     1.362
--------------------------------------------------
-----------------------------------------------------------------------

Approximate confidence intervals for between-studies SDs and I^2:
------------------------------------------------------------------------------
Variable         SD        [90% Conf. Interval]   I^2     [90% Conf. Interval]
------------------------------------------------------------------------------
z1              .51271358  .18434587  .8410813       65       19         83
z2              1.5447791  .77602029  2.3135379      87       62         94
------------------------------------------------------------------------------
Note: I^2 computed from estimated between-studies variance
      and typical within-studies variances
Note: CIs computed on SD scale

Restricted likelihood ratio test for heterogeneity: LRT =  47.26 (d.f. = 2) P =
>  0.000
P-value halved: see help j_chibar

Scalar Q test for heterogeneity: Q =  83.14 (d.f. = 15) P = 0.000

Multivariate R statistic
Measures ratio of std errors in current vs. fixed-effect analysis
------------------------------------------------------------------------------
Outcomes considered                             z1 z2
Number of parameters                            4
Sqrt determinant of variance (reml)             .0019629
                             (fixed)            .00006951
R statistic = ratio ^ (1/4)                     2.305207
------------------------------------------------------------------------------

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws (written to file z.dta)
- allowing for parameter uncertainty and between-studies variation
- figures are estimated probability (upper), Monte Carlo error (lower)
----------------------------
study and |    Treatment    
Rank      | zero    z1    z2
----------+-----------------
2         |
     Best | 86.5   4.9   8.6
          |  1.1   0.7   0.9
          | 
      2nd | 13.0  72.9  14.1
          |  1.1   1.4   1.1
          | 
    Worst |  0.5  22.2  77.3
          |  0.2   1.3   1.3
----------+-----------------
3         |
     Best | 87.6   3.5   8.9
          |  1.0   0.6   0.9
          | 
      2nd | 11.9  71.6  16.5
          |  1.0   1.4   1.2
          | 
    Worst |  0.5  24.9  74.6
          |  0.2   1.4   1.4
----------+-----------------
4         |
     Best | 87.9   2.5   9.6
          |  1.0   0.5   0.9
          | 
      2nd | 11.8  69.6  18.6
          |  1.0   1.5   1.2
          | 
    Worst |  0.3  27.9  71.8
          |  0.2   1.4   1.4
----------+-----------------
5         |
     Best | 86.4   2.1  11.5
          |  1.1   0.5   1.0
          | 
      2nd | 13.4  65.4  21.2
          |  1.1   1.5   1.3
          | 
    Worst |  0.2  32.5  67.3
          |  0.1   1.5   1.5
----------------------------
Warning: bubble plot can't show summaries - last mvmeta run had covariates
1 missing values found for z1 and displayed at z1=0
Sorry, forest plot is not yet available

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    95% Confidence Int.     95% Prediction Int.
z1           1.053691   -.0488624    2.156244   -.7014853    2.808867
z2           2.968069    .6783457    5.257792    -1.49817    7.434309
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom

. pause 

. drop rank* 

.         
. // ... AND REPLAY
. dicmd mvmeta, `replayoptstog' pi(xvar(one))


mvmeta, showall eform(EFORM) nouncertainv print(bscov) level(90)     dof(n-2) i
> 2 pbest(min in 2/5, all gen(rank) zero predict saving(z) replace mcse id(stud
> y) seed(641)) wt(sd details format(%5.3f) keepmat(SD) unscaled wide) testsigm
> a qscalar randfix(z*) bubble(name(bubble,replace) yline(0) xline(0)         c
> ol(blue green black =) lwidth(.2 = = .6) lpatt(solid = dash solid)) forest(ti
> tle(Forest plot) name(forest,replace)         xli(0) subtitle(,size(large))  
>        xlab(,labsize(large)) ylab(,labsize(large))         xrescale uv(line p
> redict) mv(line predict) weights(align(c)) ytick(none)) pi(xvar(one))
(option showall ignored with option nouncertainv)

Multivariate meta-analysis
Variance-covariance matrix = correlation I(2)
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -28.787912         Number of observations  =    10
                                               Degrees of freedom      =     8
------------------------------------------------------------------------------
             |      EFORM   Std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.018797    .089876     0.21   0.838     .8646568    1.200416
         one |   2.868217   1.611583     1.88   0.098     1.008894    8.154145
-------------+----------------------------------------------------------------
z2           |
       study |   .8341874   .1556658    -0.97   0.360     .5896045    1.180229
         one |   19.45432    22.7007     2.54   0.035      2.22157    170.3617
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
           z1         z2
z1  .26287522
z2          0  2.3863425
-------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study      one    study      one
 Study 1   25.237   34.893   20.942   29.277
 Study 2   11.264   17.882   15.521   24.882
 Study 3    9.506   19.021    9.050   18.144
 Study 4    2.546    8.171    3.020    9.358
 Study 5    0.246    4.138    0.299    3.413
 Study 6    0.520    0.705    0.285    1.181
 Study 7    4.068    0.051    1.663    0.002
 Study 8    8.176    1.378    7.167    0.823
 Study 9   10.932    3.229   15.142    3.739
Study 10   27.504   10.532   26.911    9.182
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    0.000   -0.000    0.000    0.000
  DIRECT  100.000  100.000  100.000  100.000

Details of unscaled weights:
--------------------------------------------------
          |          source and parameter         
          | ---------------- TOTAL ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.001     0.072     0.007     0.399
  Study 2 |    0.001     0.037     0.005     0.339
  Study 3 |    0.001     0.039     0.003     0.247
  Study 4 |    0.000     0.017     0.001     0.127
  Study 5 |    0.000     0.008     0.000     0.046
  Study 6 |    0.000     0.001     0.000     0.016
  Study 7 |    0.000     0.000     0.001     0.000
  Study 8 |    0.000     0.003     0.002     0.011
  Study 9 |    0.001     0.007     0.005     0.051
 Study 10 |    0.002     0.022     0.009     0.125
          | 
    Total |    0.006     0.205     0.035     1.362
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | -------------- BORROWED --------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.000    -0.000    -0.000     0.000
  Study 2 |    0.000     0.000    -0.000    -0.000
  Study 3 |    0.000     0.000     0.000     0.000
  Study 4 |   -0.000    -0.000     0.000     0.000
  Study 5 |   -0.000     0.000    -0.000    -0.000
  Study 6 |   -0.000     0.000     0.000    -0.000
  Study 7 |    0.000     0.000     0.000    -0.000
  Study 8 |   -0.000     0.000    -0.000    -0.000
  Study 9 |    0.000    -0.000     0.000     0.000
 Study 10 |    0.000    -0.000     0.000     0.000
          | 
    Total |    0.000    -0.000     0.000     0.000
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | --------------- DIRECT ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.001     0.072     0.007     0.399
  Study 2 |    0.001     0.037     0.005     0.339
  Study 3 |    0.001     0.039     0.003     0.247
  Study 4 |    0.000     0.017     0.001     0.127
  Study 5 |    0.000     0.008     0.000     0.046
  Study 6 |    0.000     0.001     0.000     0.016
  Study 7 |    0.000     0.000     0.001     0.000
  Study 8 |    0.000     0.003     0.002     0.011
  Study 9 |    0.001     0.007     0.005     0.051
 Study 10 |    0.002     0.022     0.009     0.125
          | 
    Total |    0.006     0.205     0.035     1.362
--------------------------------------------------
-----------------------------------------------------------------------

Approximate confidence intervals for between-studies SDs and I^2:
------------------------------------------------------------------------------
Variable         SD        [90% Conf. Interval]   I^2     [90% Conf. Interval]
------------------------------------------------------------------------------
z1              .51271358  .18434587  .8410813       65       19         83
z2              1.5447791  .77602029  2.3135379      87       62         94
------------------------------------------------------------------------------
Note: I^2 computed from estimated between-studies variance
      and typical within-studies variances
Note: CIs computed on SD scale

Restricted likelihood ratio test for heterogeneity: LRT =  47.26 (d.f. = 2) P =
>  0.000
P-value halved: see help j_chibar

Scalar Q test for heterogeneity: Q =  83.14 (d.f. = 15) P = 0.000

Multivariate R statistic
Measures ratio of std errors in current vs. fixed-effect analysis
------------------------------------------------------------------------------
Outcomes considered                             z1 z2
Number of parameters                            4
Sqrt determinant of variance (reml)             .0019629
                             (fixed)            .00006951
R statistic = ratio ^ (1/4)                     2.305207
------------------------------------------------------------------------------

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws (written to file z.dta)
- allowing for parameter uncertainty and between-studies variation
- figures are estimated probability (upper), Monte Carlo error (lower)
----------------------------
study and |    Treatment    
Rank      | zero    z1    z2
----------+-----------------
2         |
     Best | 86.5   4.9   8.6
          |  1.1   0.7   0.9
          | 
      2nd | 13.0  72.9  14.1
          |  1.1   1.4   1.1
          | 
    Worst |  0.5  22.2  77.3
          |  0.2   1.3   1.3
----------+-----------------
3         |
     Best | 87.6   3.5   8.9
          |  1.0   0.6   0.9
          | 
      2nd | 11.9  71.6  16.5
          |  1.0   1.4   1.2
          | 
    Worst |  0.5  24.9  74.6
          |  0.2   1.4   1.4
----------+-----------------
4         |
     Best | 87.9   2.5   9.6
          |  1.0   0.5   0.9
          | 
      2nd | 11.8  69.6  18.6
          |  1.0   1.5   1.2
          | 
    Worst |  0.3  27.9  71.8
          |  0.2   1.4   1.4
----------+-----------------
5         |
     Best | 86.4   2.1  11.5
          |  1.1   0.5   1.0
          | 
      2nd | 13.4  65.4  21.2
          |  1.1   1.5   1.3
          | 
    Worst |  0.2  32.5  67.3
          |  0.1   1.5   1.5
----------------------------
Bubble option: using data from last mvmeta run
Warning: bubble plot can't show summaries - last mvmeta run had covariates
1 missing values found for z1 and displayed at z1=0
Sorry, forest plot is not yet available

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    95% Confidence Int.     95% Prediction Int.
z1           1.053691   -.0488624    2.156244   -.7014853    2.808867
z2           2.968069    .6783457    5.257792    -1.49817    7.434309
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom

. pause 

. drop rank* 

. 
. // CHECK ALL OPTIONS TOGETHER FOR BSCOV(EXCH) 
. dicmd mvmeta z S study one, bscov(exch) ///
>         `estimateoptstog' `replayoptstog' pi(xvar(one))


mvmeta z S study one, bscov(exch)         showstart longparm     missest(1) mis
> svar(1E5) maxse(3) noconstant psdcrit(1E-3) id(studychar) showall eform(EFORM
> ) nouncertainv print(bscov) level(90)     dof(n-2) i2 pbest(min in 2/5, all g
> en(rank) zero predict saving(z) replace mcse id(study) seed(641)) wt(sd detai
> ls format(%5.3f) keepmat(SD) unscaled wide) testsigma qscalar randfix(z*) bub
> ble(name(bubble,replace) yline(0) xline(0)         col(blue green black =) lw
> idth(.2 = = .6) lpatt(solid = dash solid)) forest(title(Forest plot) name(for
> est,replace)         xli(0) subtitle(,size(large))         xlab(,labsize(larg
> e)) ylab(,labsize(large))         xrescale uv(line predict) mv(line predict) 
> weights(align(c)) ytick(none)) pi(xvar(one))
Note: using method reml
Note: regressing z1 on study one
Note: regressing z2 on study one
Note: 10 observations on 2 variables
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S11
Warning: at studychar=Study 1, z1 is missing, so I'm ignoring non-missing S12
Note: variance-covariance matrix is exchangeable

Starting value for beta's:
            z1:         z1:         z2:         z2:
         study         one       study         one
y1   .02637256   1.0287097  -.18512429   2.8626951

Starting value for Sigma (between-studies variance):
    c1  c2
r1   1
r2   0   1

initial:       log likelihood = -31.347171
rescale:       log likelihood = -31.347171
rescale eq:    log likelihood = -31.347171
Iteration 0:   log likelihood = -31.347171  
Iteration 1:   log likelihood = -30.642363  
Iteration 2:   log likelihood = -30.602324  
Iteration 3:   log likelihood = -30.602303  
Iteration 4:   log likelihood = -30.602303  
(option showall ignored with option nouncertainv)

Multivariate meta-analysis
Variance-covariance matrix = exchangeable
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -30.602303         Number of observations  =    10
                                               Degrees of freedom      =     8
------------------------------------------------------------------------------
             |      EFORM   Std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.033923   .1508572     0.23   0.825     .7882329    1.356194
         one |   2.637039   2.479593     1.03   0.333     .4589264    15.15271
-------------+----------------------------------------------------------------
z2           |
       study |    .832601   .1141927    -1.34   0.218     .6451702    1.074483
         one |   17.69278   15.26597     3.33   0.010     3.556126    88.02682
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
            z1          z2
z1    1.103021
z2  -.53896922    1.103021
-------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study      one    study      one
 Study 1   24.924   34.714   18.586   25.865
 Study 2   13.486   21.581   15.671   24.988
 Study 3    8.177   16.444   10.524   20.901
 Study 4    2.671    8.483    3.211    9.724
 Study 5    0.281    3.922    0.295    3.084
 Study 6    0.379    0.868    0.258    1.350
 Study 7    3.164    0.006    1.325    0.004
 Study 8    7.866    1.105    6.651    0.737
 Study 9   13.268    3.578   14.939    3.649
Study 10   25.785    9.299   28.539    9.697
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    0.085    0.076    0.751    0.834
  DIRECT   99.915   99.924   99.249   99.166

Details of unscaled weights:
--------------------------------------------------
          |          source and parameter         
          | ---------------- TOTAL ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.004     0.209     0.003     0.191
  Study 2 |    0.002     0.130     0.003     0.185
  Study 3 |    0.001     0.099     0.002     0.155
  Study 4 |    0.000     0.051     0.001     0.072
  Study 5 |    0.000     0.024     0.000     0.023
  Study 6 |    0.000     0.005     0.000     0.010
  Study 7 |    0.001     0.000     0.000     0.000
  Study 8 |    0.001     0.007     0.001     0.005
  Study 9 |    0.002     0.022     0.003     0.027
 Study 10 |    0.004     0.056     0.005     0.072
          | 
    Total |    0.016     0.601     0.019     0.740
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | -------------- BORROWED --------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.000     0.000     0.000     0.003
  Study 2 |    0.000     0.000     0.000     0.000
  Study 3 |    0.000     0.000     0.000     0.002
  Study 4 |    0.000     0.000     0.000     0.000
  Study 5 |    0.000     0.000     0.000     0.000
  Study 6 |    0.000     0.000     0.000     0.000
  Study 7 |    0.000     0.000     0.000     0.000
  Study 8 |    0.000     0.000     0.000     0.000
  Study 9 |    0.000     0.000     0.000     0.000
 Study 10 |    0.000     0.000     0.000     0.000
          | 
    Total |    0.000     0.000     0.000     0.006
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | --------------- DIRECT ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.004     0.209     0.003     0.189
  Study 2 |    0.002     0.130     0.003     0.185
  Study 3 |    0.001     0.099     0.002     0.152
  Study 4 |    0.000     0.051     0.001     0.072
  Study 5 |    0.000     0.024     0.000     0.023
  Study 6 |    0.000     0.005     0.000     0.010
  Study 7 |    0.001     0.000     0.000     0.000
  Study 8 |    0.001     0.007     0.001     0.005
  Study 9 |    0.002     0.021     0.003     0.027
 Study 10 |    0.004     0.056     0.005     0.071
          | 
    Total |    0.016     0.601     0.019     0.734
--------------------------------------------------
-----------------------------------------------------------------------

Approximate confidence intervals for between-studies SDs and I^2:
------------------------------------------------------------------------------
Variable         SD        [90% Conf. Interval]   I^2     [90% Conf. Interval]
------------------------------------------------------------------------------
z1              1.0502481  .60226718  1.4982289      89       72         94
z2              1.0502481  .60226718  1.4982289      75       50         86
------------------------------------------------------------------------------
Note: I^2 computed from estimated between-studies variance
      and typical within-studies variances
Note: CIs computed on SD scale

Restricted likelihood ratio test for heterogeneity: LRT =  43.64 (d.f. = 2) P =
>  0.000
P-value halved: see help j_chibar

Scalar Q test for heterogeneity: Q =  83.14 (d.f. = 15) P = 0.000

Multivariate R statistic
Measures ratio of std errors in current vs. fixed-effect analysis
------------------------------------------------------------------------------
Outcomes considered                             z1 z2
Number of parameters                            4
Sqrt determinant of variance (reml)             .00265706
                             (fixed)            .00006951
R statistic = ratio ^ (1/4)                     2.4864843
------------------------------------------------------------------------------

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws (written to file z.dta)
- allowing for parameter uncertainty and between-studies variation
- figures are estimated probability (upper), Monte Carlo error (lower)
----------------------------
study and |    Treatment    
Rank      | zero    z1    z2
----------+-----------------
2         |
     Best | 76.8  21.1   2.1
          |  1.3   1.3   0.5
          | 
      2nd | 23.1  51.5  25.4
          |  1.3   1.6   1.4
          | 
    Worst |  0.1  27.4  72.5
          |  0.1   1.4   1.4
----------+-----------------
3         |
     Best | 78.0  19.7   2.3
          |  1.3   1.3   0.5
          | 
      2nd | 21.9  49.9  28.2
          |  1.3   1.6   1.4
          | 
    Worst |  0.1  30.4  69.5
          |  0.1   1.5   1.5
----------+-----------------
4         |
     Best | 79.4  17.5   3.1
          |  1.3   1.2   0.5
          | 
      2nd | 20.5  49.9  29.6
          |  1.3   1.6   1.4
          | 
    Worst |  0.1  32.6  67.3
          |  0.1   1.5   1.5
----------+-----------------
5         |
     Best | 79.2  16.7   4.1
          |  1.3   1.2   0.6
          | 
      2nd | 20.8  46.9  32.3
          |  1.3   1.6   1.5
          | 
    Worst |  0.0  36.4  63.6
          |  0.0   1.5   1.5
----------------------------
Warning: bubble plot can't show summaries - last mvmeta run had covariates
1 missing values found for z1 and displayed at z1=0
Sorry, forest plot is not yet available

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    95% Confidence Int.     95% Prediction Int.
z1           .9696569   -.8754844    2.814798   -2.282778    4.222091
z2           2.873157    1.176358    4.569955   -.2654738    6.011787
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom

. pause 

. drop rank* 

.         
. // ... AND REPLAY
. dicmd mvmeta, `replayoptstog' pi(xvar(one))


mvmeta, showall eform(EFORM) nouncertainv print(bscov) level(90)     dof(n-2) i
> 2 pbest(min in 2/5, all gen(rank) zero predict saving(z) replace mcse id(stud
> y) seed(641)) wt(sd details format(%5.3f) keepmat(SD) unscaled wide) testsigm
> a qscalar randfix(z*) bubble(name(bubble,replace) yline(0) xline(0)         c
> ol(blue green black =) lwidth(.2 = = .6) lpatt(solid = dash solid)) forest(ti
> tle(Forest plot) name(forest,replace)         xli(0) subtitle(,size(large))  
>        xlab(,labsize(large)) ylab(,labsize(large))         xrescale uv(line p
> redict) mv(line predict) weights(align(c)) ytick(none)) pi(xvar(one))
(option showall ignored with option nouncertainv)

Multivariate meta-analysis
Variance-covariance matrix = exchangeable
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -30.602303         Number of observations  =    10
                                               Degrees of freedom      =     8
------------------------------------------------------------------------------
             |      EFORM   Std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
z1           |
       study |   1.033923   .1508572     0.23   0.825     .7882329    1.356194
         one |   2.637039   2.479593     1.03   0.333     .4589264    15.15271
-------------+----------------------------------------------------------------
z2           |
       study |    .832601   .1141927    -1.34   0.218     .6451702    1.074483
         one |   17.69278   15.26597     3.33   0.010     3.556126    88.02682
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
            z1          z2
z1    1.103021
z2  -.53896922    1.103021
-------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
               z1:      z1:      z2:      z2:
            study      one    study      one
 Study 1   24.924   34.714   18.586   25.865
 Study 2   13.486   21.581   15.671   24.988
 Study 3    8.177   16.444   10.524   20.901
 Study 4    2.671    8.483    3.211    9.724
 Study 5    0.281    3.922    0.295    3.084
 Study 6    0.379    0.868    0.258    1.350
 Study 7    3.164    0.006    1.325    0.004
 Study 8    7.866    1.105    6.651    0.737
 Study 9   13.268    3.578   14.939    3.649
Study 10   25.785    9.299   28.539    9.697
   TOTAL  100.000  100.000  100.000  100.000
BORROWED    0.085    0.076    0.751    0.834
  DIRECT   99.915   99.924   99.249   99.166

Details of unscaled weights:
--------------------------------------------------
          |          source and parameter         
          | ---------------- TOTAL ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.004     0.209     0.003     0.191
  Study 2 |    0.002     0.130     0.003     0.185
  Study 3 |    0.001     0.099     0.002     0.155
  Study 4 |    0.000     0.051     0.001     0.072
  Study 5 |    0.000     0.024     0.000     0.023
  Study 6 |    0.000     0.005     0.000     0.010
  Study 7 |    0.001     0.000     0.000     0.000
  Study 8 |    0.001     0.007     0.001     0.005
  Study 9 |    0.002     0.022     0.003     0.027
 Study 10 |    0.004     0.056     0.005     0.072
          | 
    Total |    0.016     0.601     0.019     0.740
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | -------------- BORROWED --------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.000     0.000     0.000     0.003
  Study 2 |    0.000     0.000     0.000     0.000
  Study 3 |    0.000     0.000     0.000     0.002
  Study 4 |    0.000     0.000     0.000     0.000
  Study 5 |    0.000     0.000     0.000     0.000
  Study 6 |    0.000     0.000     0.000     0.000
  Study 7 |    0.000     0.000     0.000     0.000
  Study 8 |    0.000     0.000     0.000     0.000
  Study 9 |    0.000     0.000     0.000     0.000
 Study 10 |    0.000     0.000     0.000     0.000
          | 
    Total |    0.000     0.000     0.000     0.006
--------------------------------------------------

--------------------------------------------------
          |          source and parameter         
          | --------------- DIRECT ---------------
       id | z1:study    z1:one  z2:study    z2:one
----------+---------------------------------------
  Study 1 |    0.004     0.209     0.003     0.189
  Study 2 |    0.002     0.130     0.003     0.185
  Study 3 |    0.001     0.099     0.002     0.152
  Study 4 |    0.000     0.051     0.001     0.072
  Study 5 |    0.000     0.024     0.000     0.023
  Study 6 |    0.000     0.005     0.000     0.010
  Study 7 |    0.001     0.000     0.000     0.000
  Study 8 |    0.001     0.007     0.001     0.005
  Study 9 |    0.002     0.021     0.003     0.027
 Study 10 |    0.004     0.056     0.005     0.071
          | 
    Total |    0.016     0.601     0.019     0.734
--------------------------------------------------
-----------------------------------------------------------------------

Approximate confidence intervals for between-studies SDs and I^2:
------------------------------------------------------------------------------
Variable         SD        [90% Conf. Interval]   I^2     [90% Conf. Interval]
------------------------------------------------------------------------------
z1              1.0502481  .60226718  1.4982289      89       72         94
z2              1.0502481  .60226718  1.4982289      75       50         86
------------------------------------------------------------------------------
Note: I^2 computed from estimated between-studies variance
      and typical within-studies variances
Note: CIs computed on SD scale

Restricted likelihood ratio test for heterogeneity: LRT =  43.64 (d.f. = 2) P =
>  0.000
P-value halved: see help j_chibar

Scalar Q test for heterogeneity: Q =  83.14 (d.f. = 15) P = 0.000

Multivariate R statistic
Measures ratio of std errors in current vs. fixed-effect analysis
------------------------------------------------------------------------------
Outcomes considered                             z1 z2
Number of parameters                            4
Sqrt determinant of variance (reml)             .00265706
                             (fixed)            .00006951
R statistic = ratio ^ (1/4)                     2.4864843
------------------------------------------------------------------------------

Estimated probabilities (%) of each treatment having each rank
- assuming the minimum parameter is the best
- using 1000 draws (written to file z.dta)
- allowing for parameter uncertainty and between-studies variation
- figures are estimated probability (upper), Monte Carlo error (lower)
----------------------------
study and |    Treatment    
Rank      | zero    z1    z2
----------+-----------------
2         |
     Best | 76.8  21.1   2.1
          |  1.3   1.3   0.5
          | 
      2nd | 23.1  51.5  25.4
          |  1.3   1.6   1.4
          | 
    Worst |  0.1  27.4  72.5
          |  0.1   1.4   1.4
----------+-----------------
3         |
     Best | 78.0  19.7   2.3
          |  1.3   1.3   0.5
          | 
      2nd | 21.9  49.9  28.2
          |  1.3   1.6   1.4
          | 
    Worst |  0.1  30.4  69.5
          |  0.1   1.5   1.5
----------+-----------------
4         |
     Best | 79.4  17.5   3.1
          |  1.3   1.2   0.5
          | 
      2nd | 20.5  49.9  29.6
          |  1.3   1.6   1.4
          | 
    Worst |  0.1  32.6  67.3
          |  0.1   1.5   1.5
----------+-----------------
5         |
     Best | 79.2  16.7   4.1
          |  1.3   1.2   0.6
          | 
      2nd | 20.8  46.9  32.3
          |  1.3   1.6   1.5
          | 
    Worst |  0.0  36.4  63.6
          |  0.0   1.5   1.5
----------------------------
Bubble option: using data from last mvmeta run
Warning: bubble plot can't show summaries - last mvmeta run had covariates
1 missing values found for z1 and displayed at z1=0
Sorry, forest plot is not yet available

Table of prediction intervals for the meta-regression intercepts
----------------------------------------------------------------------
Outcome     Estimate    95% Confidence Int.     95% Prediction Int.
z1           .9696569   -.8754844    2.814798   -2.282778    4.222091
z2           2.873157    1.176358    4.569955   -.2654738    6.011787
----------------------------------------------------------------------
Note: using N-2=8 degrees of freedom

. pause 

. drop rank* 

. 
. // CHECK BUBBLE AND FOREST WITH SUMMARIES
. dicmd mvmeta y S, `bubble'


mvmeta y S, bubble(name(bubble,replace) yline(0) xline(0)         col(blue gree
> n black =) lwidth(.2 = = .6) lpatt(solid = dash solid))
Note: using method reml
Note: using variables y1 y2
Note: 10 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -24.474456
rescale:       log likelihood = -24.474456
rescale eq:    log likelihood = -24.472315
Iteration 0:   log likelihood = -24.472315  
Iteration 1:   log likelihood =  -24.41615  
Iteration 2:   log likelihood = -24.415968  
Iteration 3:   log likelihood = -24.415968  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -24.415968         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.166187   .1863276     6.26   0.000     .8009913    1.531382
          y2 |   2.057752   .5607259     3.67   0.000     .9587493    3.156755
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .44965665          1          .
y2  1.6073388         -1          1
----------------------------------------------------

. pause 

. dicmd mvmeta y S, `forest'


mvmeta y S, forest(title(Forest plot) name(forest,replace)         xli(0) subti
> tle(,size(large))         xlab(,labsize(large)) ylab(,labsize(large))        
>  xrescale uv(line predict) mv(line predict) weights(align(c)) ytick(none))
Note: using method reml
Note: using variables y1 y2
Note: 10 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -24.474456
rescale:       log likelihood = -24.474456
rescale eq:    log likelihood = -24.472315
Iteration 0:   log likelihood = -24.472315  
Iteration 1:   log likelihood =  -24.41615  
Iteration 2:   log likelihood = -24.415968  
Iteration 3:   log likelihood = -24.415968  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -24.415968         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.166187   .1863276     6.26   0.000     .8009913    1.531382
          y2 |   2.057752   .5607259     3.67   0.000     .9587493    3.156755
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .44965665          1          .
y2  1.6073388         -1          1
----------------------------------------------------
Sorry, forest plot is not yet available

. pause 

. 
. // CHECK NUMERICAL RESULTS FOR corr(riley)
. drop S12

. dicmd mvmeta y S, wscorr(riley)


mvmeta y S, wscorr(riley)
Note: using method reml
Note: using variables y1 y2
Note: 10 observations on 2 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -31.257376
rescale:       log likelihood = -31.257376
rescale eq:    log likelihood =   -27.9627
Iteration 0:   log likelihood =   -27.9627  (not concave)
Iteration 1:   log likelihood = -25.293568  
Iteration 2:   log likelihood =  -24.62806  
Iteration 3:   log likelihood = -24.609924  
Iteration 4:   log likelihood = -24.609892  
Iteration 5:   log likelihood = -24.609892  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -24.609892         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.155126   .1874202     6.16   0.000     .7877887    1.522462
          y2 |   2.085362   .5741638     3.63   0.000     .9600218    3.210703
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
            SD          y1          y2
y1   .44273942           1           .
y2   1.6437795  -.72026689           1
------------------------------------------------------------

. pause 

. assert abs(_b[y1] - 1.155125567887) < 1E-6

. 
. // SPARSE DATA 
. use MYCN, clear
(MYCN data as used in Jackson et al SiM/RSS paper)

. drop y4

. drop if !mi(y2) & !mi(y3)
(3 observations deleted)

. gen S12=0.5*sqrt(S11*S22)
(67 missing values generated)

. gen S13=0.5*sqrt(S11*S33)
(59 missing values generated)

. mvmeta y S, var(y?) bscov(exch 0.5)
Note: using method reml
Note: using variables y1 y2 y3
Warning: 1 observation has all outcomes missing, and has been dropped from anal
> ysis
Note: 69 observations on 3 variables
Warning: Neither S23 nor S32 found, and wscorr() not specified - not a problem 
> as y2, y3 are never jointly observed
Warning: unstructured-variance method of moments failed - I2 statistic is not a
> vailable
Note: variance-covariance matrix is proportional to .5*I(3)+.5*J(3,3,1)

initial:       log likelihood = -115.61006
rescale:       log likelihood = -115.61006
rescale eq:    log likelihood =  -110.8469
Iteration 0:   log likelihood =  -110.8469  
Iteration 1:   log likelihood = -109.58186  
Iteration 2:   log likelihood =  -109.5751  
Iteration 3:   log likelihood =  -109.5751  

Multivariate meta-analysis
Variance-covariance matrix = proportional .5*I(3)+.5*J(3,3,1)
Method = reml                                  Number of dimensions    =     3
Restricted log likelihood = -109.5751          Number of observations  =    69
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.575289   .1422703    11.07   0.000     1.296445    1.854134
          y2 |   1.318087   .3144557     4.19   0.000     .7017647    1.934409
          y3 |   1.713745   .1285702    13.33   0.000     1.461752    1.965738
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2         y3
y1  .61285292          1          .          .
y2  .61285292         .5          1          .
y3  .61285292         .5         .5          1
----------------------------------------------------

. mvmeta y S, var(y?) bscov(exch 0.5) warn(text)
Note: using method reml
Note: using variables y1 y2 y3
Warning: 1 observation has all outcomes missing, and has been dropped from anal
> ysis
Note: 69 observations on 3 variables
Warning: Neither S23 nor S32 found, and wscorr() not specified - not a problem 
> as y2, y3 are never jointly observed
Warning: unstructured-variance method of moments failed - I2 statistic is not a
> vailable
Note: variance-covariance matrix is proportional to .5*I(3)+.5*J(3,3,1)

initial:       log likelihood = -115.61006
rescale:       log likelihood = -115.61006
rescale eq:    log likelihood =  -110.8469
Iteration 0:   log likelihood =  -110.8469  
Iteration 1:   log likelihood = -109.58186  
Iteration 2:   log likelihood =  -109.5751  
Iteration 3:   log likelihood =  -109.5751  

Multivariate meta-analysis
Variance-covariance matrix = proportional .5*I(3)+.5*J(3,3,1)
Method = reml                                  Number of dimensions    =     3
Restricted log likelihood = -109.5751          Number of observations  =    69
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.575289   .1422703    11.07   0.000     1.296445    1.854134
          y2 |   1.318087   .3144557     4.19   0.000     .7017647    1.934409
          y3 |   1.713745   .1285702    13.33   0.000     1.461752    1.965738
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2         y3
y1  .61285292          1          .          .
y2  .61285292         .5          1          .
y3  .61285292         .5         .5          1
----------------------------------------------------

. mvmeta y S, var(y?) bscov(exch 0.5) warn(off)
Note: using method reml
Note: using variables y1 y2 y3
Note: 69 observations on 3 variables
Note: variance-covariance matrix is proportional to .5*I(3)+.5*J(3,3,1)

initial:       log likelihood = -115.61006
rescale:       log likelihood = -115.61006
rescale eq:    log likelihood =  -110.8469
Iteration 0:   log likelihood =  -110.8469  
Iteration 1:   log likelihood = -109.58186  
Iteration 2:   log likelihood =  -109.5751  
Iteration 3:   log likelihood =  -109.5751  

Multivariate meta-analysis
Variance-covariance matrix = proportional .5*I(3)+.5*J(3,3,1)
Method = reml                                  Number of dimensions    =     3
Restricted log likelihood = -109.5751          Number of observations  =    69
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.575289   .1422703    11.07   0.000     1.296445    1.854134
          y2 |   1.318087   .3144557     4.19   0.000     .7017647    1.934409
          y3 |   1.713745   .1285702    13.33   0.000     1.461752    1.965738
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2         y3
y1  .61285292          1          .          .
y2  .61285292         .5          1          .
y3  .61285292         .5         .5          1
----------------------------------------------------

. 
. // CHECK PENALTY OPTION REDUCES BS CORRELATION
. drop S12 S13

. forvalues i=0/2 {
  2.         if `i'==0 local penalty
  3.         if `i'==1 local penalty penalty(0)
  4.         if `i'==2 local penalty penalty(0.1)
  5.         dicmd mvmeta y S, var(y1 y2) wscorr(riley) `penalty'
  6.         mat Sigma = e(Sigma)
  7.         local rho`i' = Sigma[1,2]/sqrt(Sigma[1,1]*Sigma[2,2])
  8. }


mvmeta y S, var(y1 y2) wscorr(riley) 
Note: using method reml
Note: using variables y1 y2
Warning: 37 observations have all outcomes missing, and have been dropped from 
> analysis
Note: 33 observations on 2 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -49.574654
rescale:       log likelihood = -49.574654
rescale eq:    log likelihood = -47.289012
Iteration 0:   log likelihood = -47.289012  
Iteration 1:   log likelihood = -46.765752  
Iteration 2:   log likelihood = -46.700539  
Iteration 3:   log likelihood = -46.699524  
Iteration 4:   log likelihood = -46.699523  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -46.699523         Number of observations  =    33
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.595018   .1478387    10.79   0.000      1.30526    1.884776
          y2 |   1.386403   .5030174     2.76   0.006     .4005066    2.372298
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
           SD         y1         y2
y1  .59754222          1          .
y2  .89640629  .20018371          1
------------------------------------------------------------


mvmeta y S, var(y1 y2) wscorr(riley) penalty(0)
Note: using method reml
Note: using variables y1 y2
Warning: 37 observations have all outcomes missing, and have been dropped from 
> analysis
Note: 33 observations on 2 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -49.574654
rescale:       log likelihood = -49.574654
rescale eq:    log likelihood = -47.289012
Iteration 0:   log likelihood = -47.289012  
Iteration 1:   log likelihood = -46.765752  
Iteration 2:   log likelihood = -46.700539  
Iteration 3:   log likelihood = -46.699524  
Iteration 4:   log likelihood = -46.699523  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -46.699523         Number of observations  =    33
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.595018   .1478387    10.79   0.000      1.30526    1.884776
          y2 |   1.386403   .5030174     2.76   0.006     .4005066    2.372298
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
           SD         y1         y2
y1  .59754222          1          .
y2  .89640629  .20018371          1
------------------------------------------------------------


mvmeta y S, var(y1 y2) wscorr(riley) penalty(0.1)
Note: using method reml
Note: log likelihood enhanced by penalty term .1 * log(det(corr(Sigma)))
Note: using variables y1 y2
Warning: 37 observations have all outcomes missing, and have been dropped from 
> analysis
Note: 33 observations on 2 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -49.574654
rescale:       log likelihood = -49.574654
rescale eq:    log likelihood = -47.289012
Iteration 0:   log likelihood = -47.289012  
Iteration 1:   log likelihood = -46.759859  
Iteration 2:   log likelihood = -46.703901  
Iteration 3:   log likelihood = -46.703313  
Iteration 4:   log likelihood = -46.703313  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -46.703313         Number of observations  =    33
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.595416   .1479026    10.79   0.000     1.305532      1.8853
          y2 |   1.391943   .4995253     2.79   0.005     .4128917    2.370995
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
           SD         y1         y2
y1  .59783009          1          .
y2  .89451228  .18572755          1
------------------------------------------------------------

. assert reldif(`rho0', `rho1') < 1E-6

. assert abs(`rho2') < abs(`rho1')

. 
. * also check that penalty ensures convergence
. use MYCN, clear
(MYCN data as used in Jackson et al SiM/RSS paper)

. drop year

. 
. mvmeta y S, wscorr(riley) iter(30)
Note: using method reml
Note: using variables y1 y2 y3 y4
Note: 73 observations on 4 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -144.18846
rescale:       log likelihood = -144.18846
rescale eq:    log likelihood = -136.94856
Iteration 0:   log likelihood = -136.94856  (not concave)
Iteration 1:   log likelihood = -132.92621  (not concave)
Iteration 2:   log likelihood = -131.26203  (not concave)
Iteration 3:   log likelihood = -130.45101  (not concave)
Iteration 4:   log likelihood =  -129.0503  (not concave)
Iteration 5:   log likelihood =  -119.9588  (not concave)
Iteration 6:   log likelihood = -117.37941  (not concave)
Iteration 7:   log likelihood = -115.31696  (not concave)
Iteration 8:   log likelihood = -113.86301  (not concave)
Iteration 9:   log likelihood = -112.86941  (not concave)
Iteration 10:  log likelihood = -112.25866  (not concave)
Iteration 11:  log likelihood = -111.81971  (not concave)
Iteration 12:  log likelihood = -111.67593  (not concave)
Iteration 13:  log likelihood = -111.59395  (not concave)
Iteration 14:  log likelihood =  -111.5705  (not concave)
Iteration 15:  log likelihood = -111.56279  (not concave)
Iteration 16:  log likelihood = -111.55812  (not concave)
Iteration 17:  log likelihood = -111.55728  (not concave)
Iteration 18:  log likelihood = -111.55665  (not concave)
Iteration 19:  log likelihood = -111.55625  (not concave)
Iteration 20:  log likelihood = -111.55616  (not concave)
Iteration 21:  log likelihood = -111.55604  (not concave)
Iteration 22:  log likelihood = -111.55601  (not concave)
Iteration 23:  log likelihood = -111.55599  (not concave)
Iteration 24:  log likelihood = -111.55598  (not concave)
Iteration 25:  log likelihood = -111.55598  (not concave)
Iteration 26:  log likelihood = -111.55597  (not concave)
Iteration 27:  log likelihood = -111.55597  (not concave)
Iteration 28:  log likelihood = -111.55597  (not concave)
Iteration 29:  log likelihood = -111.55597  (not concave)
Iteration 30:  log likelihood = -111.55597  (not concave)
convergence not achieved

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -111.55597         Number of observations  =    73
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.611413    .000043  3.7e+04   0.000     1.611329    1.611497
          y2 |   1.310911   .0001649  7950.05   0.000     1.310587    1.311234
          y3 |   1.753181          .        .       .            .           .
          y4 |    1.21089   .0000396  3.1e+04   0.000     1.210813    1.210968
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
            SD          y1          y2          y3          y4
y1   .48082974           1           .           .           .
y2   .65462384  -.22349215           1           .           .
y3   .68790587   .91747167   .03152677           1           .
y4    .2494137   .93707645  -.06726987   .79516672           1
------------------------------------------------------------

. assert e(converged) == 0

. mvmeta y S, wscorr(riley) iter(30) penalty(1)
Note: using method reml
Note: log likelihood enhanced by penalty term 1 * log(det(corr(Sigma)))
Note: using variables y1 y2 y3 y4
Note: 73 observations on 4 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -144.18846
rescale:       log likelihood = -144.18846
rescale eq:    log likelihood = -136.94856
Iteration 0:   log likelihood = -136.94856  (not concave)
Iteration 1:   log likelihood = -135.54169  (not concave)
Iteration 2:   log likelihood =  -130.3421  (not concave)
Iteration 3:   log likelihood = -129.24465  (not concave)
Iteration 4:   log likelihood =  -122.1689  (not concave)
Iteration 5:   log likelihood = -119.78686  (not concave)
Iteration 6:   log likelihood = -119.14188  (not concave)
Iteration 7:   log likelihood = -118.45416  
Iteration 8:   log likelihood = -118.26256  
Iteration 9:   log likelihood = -118.24442  
Iteration 10:  log likelihood = -118.24393  
Iteration 11:  log likelihood = -118.24393  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -118.24393         Number of observations  =    73
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.594177   .1024106    15.57   0.000     1.393456    1.794898
          y2 |   1.222629   .2862492     4.27   0.000     .6615907    1.783667
          y3 |   1.726921   .1177348    14.67   0.000     1.496165    1.957677
          y4 |   1.118814   .1583872     7.06   0.000     .8083808    1.429247
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
           SD         y1         y2         y3         y4
y1  .47925635          1          .          .          .
y2   .6794588  .37438025          1          .          .
y3  .66813198  .91921304  .16730791          1          .
y4  .67483848  .92803592  .53417579  .70810907          1
------------------------------------------------------------

. assert e(converged) == 1

. 
. // TEST NEW BSCOV(EXCH)
. mvmeta y S, wscorr(riley) iter(30) bscov(exch)
Note: using method reml
Note: using variables y1 y2 y3 y4
Note: 73 observations on 4 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is exchangeable

initial:       log likelihood = -144.18846
rescale:       log likelihood = -144.18846
rescale eq:    log likelihood = -136.94856
Iteration 0:   log likelihood = -136.94856  
Iteration 1:   log likelihood = -126.53352  
Iteration 2:   log likelihood = -124.33095  
Iteration 3:   log likelihood = -124.05661  
Iteration 4:   log likelihood = -124.05597  
Iteration 5:   log likelihood = -124.05597  

Multivariate meta-analysis
Variance-covariance matrix = exchangeable
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -124.05597         Number of observations  =    73
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.566899   .1219518    12.85   0.000     1.327877     1.80592
          y2 |   1.258798   .1972574     6.38   0.000     .8721807    1.645415
          y3 |   1.714497     .11687    14.67   0.000     1.485436    1.943558
          y4 |   1.061898   .1884003     5.64   0.000     .6926401    1.431156
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
           SD         y1         y2         y3         y4
y1  .62181789          1          .          .          .
y2  .62181789  .76768947          1          .          .
y3  .62181789  .76768947  .76768947          1          .
y4  .62181789  .76768947  .76768947  .76768947          1
------------------------------------------------------------

. local rhoest = [rho]_b[_cons]

. mat best6 = e(b)

. mat best5 = best6[1,1..5]

. local se1 = _se[y1]

. 
. * compare with bscov(exch #) for the estimated #
. mvmeta y S, wscorr(riley) iter(30) bscov(exch `rhoest')
Note: using method reml
Note: using variables y1 y2 y3 y4
Note: 73 observations on 4 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is proportional to .2323105348437412*I(4)+.767
> 6894651562588*J(4,4,1)

initial:       log likelihood =  -131.1802
rescale:       log likelihood =  -131.1802
rescale eq:    log likelihood = -125.62277
Iteration 0:   log likelihood = -125.62277  
Iteration 1:   log likelihood = -124.06848  
Iteration 2:   log likelihood = -124.05598  
Iteration 3:   log likelihood = -124.05597  

Multivariate meta-analysis
Variance-covariance matrix = proportional .2323105348437412*I(4)+.7676894651562
> 588*J(4,4,1)
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -124.05597         Number of observations  =    73
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.566899   .1219335    12.85   0.000     1.327913    1.805884
          y2 |   1.258798   .1971779     6.38   0.000     .8723365     1.64526
          y3 |   1.714497    .116784    14.68   0.000     1.485604    1.943389
          y4 |   1.061898   .1870553     5.68   0.000     .6952764     1.42852
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
           SD         y1         y2         y3         y4
y1  .62181775          1          .          .          .
y2  .62181775  .76768947          1          .          .
y3  .62181775  .76768947  .76768947          1          .
y4  .62181775  .76768947  .76768947  .76768947          1
------------------------------------------------------------

. mat eb = e(b)

. assert mreldif(best5,eb) < 1E-7 // point estimates should be the same

. assert _se[y1] < `se1' // SEs should be smaller

. 
. * invariance to starting values
. mvmeta y S, wscorr(riley) iter(30) bscov(exch) start(2 0)
Note: using method reml
Note: using variables y1 y2 y3 y4
Note: 73 observations on 4 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is exchangeable

initial:       log likelihood = -180.50625
rescale:       log likelihood = -166.86817
rescale eq:    log likelihood = -137.78101
Iteration 0:   log likelihood = -137.78101  
Iteration 1:   log likelihood = -127.16264  
Iteration 2:   log likelihood = -124.59219  
Iteration 3:   log likelihood = -124.05925  
Iteration 4:   log likelihood = -124.05598  
Iteration 5:   log likelihood = -124.05597  

Multivariate meta-analysis
Variance-covariance matrix = exchangeable
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -124.05597         Number of observations  =    73
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.566899   .1219518    12.85   0.000     1.327877     1.80592
          y2 |   1.258798   .1972574     6.38   0.000     .8721807    1.645415
          y3 |   1.714497     .11687    14.67   0.000     1.485436    1.943558
          y4 |   1.061898   .1884003     5.64   0.000       .69264    1.431156
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
           SD         y1         y2         y3         y4
y1  .62181774          1          .          .          .
y2  .62181774  .76768928          1          .          .
y3  .62181774  .76768928  .76768928          1          .
y4  .62181774  .76768928  .76768928  .76768928          1
------------------------------------------------------------

. mat eb = e(b)

. assert mreldif(best6,eb) < 2E-7 // point estimates should be the same

. di reldif(_se[y1], `se1') 
5.355e-09

. assert reldif(_se[y1], `se1') < 1E-7 // SEs should be the same

. 
. // TEST TAULOG
. foreach bscov in "bscov(prop I(4))" "bscov(exch)" {
  2.         foreach taulog in notaulog taulog {
  3.                 dicmd mvmeta y S, wscorr(0.3) `bscov' `taulog'
  4.                 mat Sigma`taulog' = e(Sigma)    
  5.         }
  6.         assert mreldif(Sigmanotaulog, Sigmataulog) < 1E-6
  7.                 // Sigmas should be the same: relaxed after Ella got 3E-6
. }


mvmeta y S, wscorr(0.3) bscov(prop I(4)) notaulog
Note: using method reml
Note: using variables y1 y2 y3 y4
Note: 73 observations on 4 variables
Note: wscorr(0.3) used for all covariances
Note: variance-covariance matrix is proportional to I(4)

initial:       log likelihood = -142.33576
rescale:       log likelihood = -142.33576
rescale eq:    log likelihood = -132.34847
Iteration 0:   log likelihood = -132.34847  
Iteration 1:   log likelihood =  -131.9295  
Iteration 2:   log likelihood = -131.92872  
Iteration 3:   log likelihood = -131.92872  

Multivariate meta-analysis
Variance-covariance matrix = proportional I(4)
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -131.92872         Number of observations  =    73
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.570111   .1305968    12.02   0.000     1.314147    1.826076
          y2 |   1.320575   .2513671     5.25   0.000     .8279048    1.813246
          y3 |   1.688163   .1181219    14.29   0.000     1.456648    1.919678
          y4 |   1.231729   .2469579     4.99   0.000     .7477001    1.715757
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2         y3         y4
y1  .54098907          1          .          .          .
y2  .54098907          0          1          .          .
y3  .54098907          0          0          1          .
y4  .54098907          0          0          0          1
----------------------------------------------------


mvmeta y S, wscorr(0.3) bscov(prop I(4)) taulog
Note: using method reml
Note: using variables y1 y2 y3 y4
Note: 73 observations on 4 variables
Note: wscorr(0.3) used for all covariances
Note: variance-covariance matrix is proportional to I(4)

initial:       log likelihood = -203.50624
rescale:       log likelihood = -177.72022
rescale eq:    log likelihood =  -133.0867
Iteration 0:   log likelihood =  -133.0867  
Iteration 1:   log likelihood = -131.95488  
Iteration 2:   log likelihood = -131.92873  
Iteration 3:   log likelihood = -131.92872  

Multivariate meta-analysis
Variance-covariance matrix = proportional I(4)
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -131.92872         Number of observations  =    73
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.570111   .1305967    12.02   0.000     1.314146    1.826076
          y2 |   1.320575   .2513671     5.25   0.000     .8279049    1.813246
          y3 |   1.688163   .1181219    14.29   0.000     1.456648    1.919677
          y4 |   1.231729   .2469579     4.99   0.000     .7477001    1.715757
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2         y3         y4
y1  .54098897          1          .          .          .
y2  .54098897          0          1          .          .
y3  .54098897          0          0          1          .
y4  .54098897          0          0          0          1
----------------------------------------------------


mvmeta y S, wscorr(0.3) bscov(exch) notaulog
Note: using method reml
Note: using variables y1 y2 y3 y4
Note: 73 observations on 4 variables
Note: wscorr(0.3) used for all covariances
Note: variance-covariance matrix is exchangeable

initial:       log likelihood = -142.33576
rescale:       log likelihood = -142.33576
rescale eq:    log likelihood = -132.34847
Iteration 0:   log likelihood = -132.34847  
Iteration 1:   log likelihood =  -128.0545  
Iteration 2:   log likelihood = -126.47687  
Iteration 3:   log likelihood =  -126.1131  
Iteration 4:   log likelihood = -125.98338  
Iteration 5:   log likelihood = -125.97829  
Iteration 6:   log likelihood = -125.97829  

Multivariate meta-analysis
Variance-covariance matrix = exchangeable
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -125.97829         Number of observations  =    73
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.574129   .1245322    12.64   0.000      1.33005    1.818207
          y2 |   1.312139   .1979192     6.63   0.000     .9242247    1.700054
          y3 |   1.705187   .1179297    14.46   0.000     1.474049    1.936325
          y4 |   1.131385   .1889081     5.99   0.000     .7611322    1.501638
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2         y3         y4
y1  .61986221          1          .          .          .
y2  .61986221  1.0415095          1          .          .
y3  .61986221  1.0415095  1.0415095          1          .
y4  .61986221  1.0415095  1.0415095  1.0415095          1
----------------------------------------------------


mvmeta y S, wscorr(0.3) bscov(exch) taulog
Note: using method reml
Note: using variables y1 y2 y3 y4
Note: 73 observations on 4 variables
Note: wscorr(0.3) used for all covariances
Note: variance-covariance matrix is exchangeable

initial:       log likelihood = -142.33576
rescale:       log likelihood = -142.33576
rescale eq:    log likelihood = -142.33576
Iteration 0:   log likelihood = -142.33576  (not concave)
Iteration 1:   log likelihood = -134.89066  (not concave)
Iteration 2:   log likelihood = -132.09579  
Iteration 3:   log likelihood = -126.24143  
Iteration 4:   log likelihood = -125.99997  
Iteration 5:   log likelihood =  -125.9783  
Iteration 6:   log likelihood = -125.97829  
Iteration 7:   log likelihood = -125.97829  

Multivariate meta-analysis
Variance-covariance matrix = exchangeable
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -125.97829         Number of observations  =    73
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.574129   .1245322    12.64   0.000      1.33005    1.818207
          y2 |   1.312139   .1979193     6.63   0.000     .9242246    1.700054
          y3 |   1.705187   .1179297    14.46   0.000     1.474049    1.936325
          y4 |   1.131385   .1889081     5.99   0.000     .7611322    1.501638
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2         y3         y4
y1   .6198622          1          .          .          .
y2   .6198622  1.0415094          1          .          .
y3   .6198622  1.0415094  1.0415094          1          .
y4   .6198622  1.0415094  1.0415094  1.0415094          1
----------------------------------------------------

. 
. // TEST CONSTRAINTS
. use telomerase2, clear
(Riley's telomerase data)

. for var y2 S12 S22: replace X=. in 1

->  replace y2=. in 1
(1 real change made, 1 to missing)

->  replace S12=. in 1
(1 real change made, 1 to missing)

->  replace S22=. in 1
(1 real change made, 1 to missing)

. 
. * 1. Standard analysis
. mvmeta y S, bscov(uns) taulog nounc 
Note: using method reml
Note: using variables y1 y2
Note: 10 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood =   -22.8524
rescale:       log likelihood =   -22.8524
rescale eq:    log likelihood =   -22.8524
Iteration 0:   log likelihood =   -22.8524  
Iteration 1:   log likelihood = -22.783895  
Iteration 2:   log likelihood = -22.764924  
Iteration 3:   log likelihood = -22.764475  
Iteration 4:   log likelihood = -22.764474  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -22.764474         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.167969   .1852274     6.31   0.000     .8049295    1.531008
          y2 |   1.968207   .5637553     3.49   0.000     .8632665    3.073147
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .44591793          1          .
y2  1.6015111         -1          1
----------------------------------------------------

. * store useful results
. mat Sigma=e(Sigma)

. foreach n in 11 12 22 {
  2.         local c`n'=[chol`n']_cons
  3.         constraint `n' [chol`n']_cons = `c`n''
  4. }

. * store nounc SEs (not stored automatically because nounc is a Replay option)
. * code from Replay
. tempname V V2 

. mat `V' = e(V)

. mat `V2' = invsym(`V')

. mat `V2' = `V2'[1..`e(nparms_mean)',1..`e(nparms_mean)']

. mat `V2' = invsym(`V2')

. local se1 =  sqrt(`V2'[1,1])

. 
. * 2. Fix Sigma by bscov(eq)
. mvmeta y S, bscov(eq Sigma) nounc 
Note: using method reml
Note: using variables y1 y2
Note: 10 observations on 2 variables

Multivariate meta-analysis
Variance-covariance matrix = equals Sigma
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -22.764474         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.167969   .1852274     6.31   0.000     .8049295    1.531008
          y2 |   1.968207   .5637553     3.49   0.000     .8632666    3.073147
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Specified between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .44591793          1          .
y2  1.6015111         -1          1
----------------------------------------------------

. di reldif(_se[y1],`se1') 
5.622e-10

. assert reldif(_se[y1],`se1') < 1E-7

. 
. * 3. Fix Sigma by constraints
. mvmeta y S, bscov(uns) taulog constraint(11 12 22) nounc 
Note: using method reml
Note: using variables y1 y2
Note: 10 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood =   -22.8524
rescale:       log likelihood =   -22.8524
rescale eq:    log likelihood =   -22.8524
Iteration 0:   log likelihood = -22.767904  
Iteration 1:   log likelihood = -22.764474  
Iteration 2:   log likelihood = -22.764474  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -22.764474         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.167969   .1852274     6.31   0.000     .8049295    1.531008
          y2 |   1.968207   .5637553     3.49   0.000     .8632666    3.073147
------------------------------------------------------------------------------
Note: these standard errors ignore uncertainty in Sigma.

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .44591793          1          .
y2  1.6015111         -1          1
----------------------------------------------------

. di reldif(_se[y1],`se1') 
5.454e-09

. assert reldif(_se[y1],`se1') < 1E-7

. 
. 
. // CHECK THE STATA HELP FILES
. * runhelpfile is in scripts
. cap runhelpfile // just to load it

. cd "`mvmetadir'package"
c:\ado\ian\mvmeta\package

. runhelpfile using mvmeta.sthlp, skip(net)
Skipping command: net get st0156, from(http://www.stata-journal.com/software/sj
> 9-1)
Running command: use fscstage1, clear
Running command: mvmeta b V
Note: using method reml
Note: using variables b_Ifg_2 b_Ifg_3 b_Ifg_4 b_Ifg_5
Note: 31 observations on 4 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood =  -80.51611
rescale:       log likelihood =  -80.51611
rescale eq:    log likelihood = -80.071916
Iteration 0:   log likelihood = -80.071916  (not concave)
Iteration 1:   log likelihood = -79.723602  
Iteration 2:   log likelihood = -79.561239  
Iteration 3:   log likelihood = -79.504997  
Iteration 4:   log likelihood = -79.492132  
Iteration 5:   log likelihood = -79.489355  
Iteration 6:   log likelihood = -79.489137  
Iteration 7:   log likelihood = -79.489126  
Iteration 8:   log likelihood = -79.489126  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -79.489126         Number of observations  =    31
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
     b_Ifg_2 |   .1615843   .0796996     2.03   0.043      .005376    .3177925
     b_Ifg_3 |   .3926019   .0878114     4.47   0.000     .2204947    .5647091
     b_Ifg_4 |   .5620076   .0905924     6.20   0.000     .3844497    .7395654
     b_Ifg_5 |   .8973289   .0942602     9.52   0.000     .7125823    1.082075
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD    b_Ifg_2    b_Ifg_3    b_Ifg_4    b_Ifg_5
b_Ifg_2  .22734098          1          .          .          .
b_Ifg_3  .28611308  .98953779          1          .          .
b_Ifg_4  .30834248  .97421953  .99657554          1          .
b_Ifg_5   .3274275    .706215    .800972  .84773414          1
----------------------------------------------------
Skipping command: net from http://www.homepages.ucl.ac.uk/~rmjwiww/stata/

. runhelpfile using mvmetademo_run.sthlp, skip(net)
Skipping command: net from http://www.homepages.ucl.ac.uk/~rmjwiww/stata/
Running command: use berkey, clear
Running command: l, noo sep(0)

  +-----------------------------------------------------------+
  | trial   pubyear     y1      y2      V11      V22      V12 |
  |-----------------------------------------------------------|
  |     1         0   0.47   -0.32   0.0075   0.0077   0.0030 |
  |     2        -1   0.20   -0.60   0.0057   0.0008   0.0009 |
  |     3        -4   0.40   -0.12   0.0021   0.0014   0.0007 |
  |     4         4   0.26   -0.31   0.0029   0.0015   0.0009 |
  |     5         5   0.56   -0.39   0.0148   0.0304   0.0072 |
  +-----------------------------------------------------------+
Running command: mvmeta y V, noestimate bubble
Note: using method reml
Note: using variables y1 y2
Note: 5 observations on 2 variables
Note: noestimates option - model not fitted
Running command: mvmeta y V
Note: using method reml
Note: using variables y1 y2
Note: 5 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood =  1.7688025
rescale:       log likelihood =  1.7688025
rescale eq:    log likelihood =  2.0331186
Iteration 0:   log likelihood =  2.0331186  
Iteration 1:   log likelihood =  2.0800528  
Iteration 2:   log likelihood =  2.0823255  
Iteration 3:   log likelihood =  2.0823296  
Iteration 4:   log likelihood =  2.0823296  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = 2.0823296          Number of observations  =     5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   .3534282    .061272     5.77   0.000     .2333372    .4735191
          y2 |  -.3392152     .08927    -3.80   0.000    -.5141811   -.1642493
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1   .1083191          1          .
y2  .18069681  .60879871          1
----------------------------------------------------
Running command: mvmeta y V, var(y1)
Note: using method reml
Note: using variable y1
Note: 5 observations on 1 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood =   1.350248
rescale:       log likelihood =   1.350248
rescale eq:    log likelihood =   1.350248
Iteration 0:   log likelihood =   1.350248  
Iteration 1:   log likelihood =  1.3588224  
Iteration 2:   log likelihood =  1.3588365  
Iteration 3:   log likelihood =  1.3588365  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     1
Restricted log likelihood = 1.3588365          Number of observations  =     5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   .3605763    .060013     6.01   0.000     .2429531    .4781995
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1
y1  .10895209          1
----------------------------------------------------
Running command: gen s1 = sqrt(V11)
Running command: metan y1 s1

Studies included: 5
Participants included: Unknown

Meta-analysis pooling of aggregate data
using the common-effect inverse-variance model

--------------------------------------------------------------------
Study                |   Effect    [95% Conf. Interval]   % Weight
---------------------+----------------------------------------------
1                    |     0.470      0.300     0.640      11.14
2                    |     0.200      0.052     0.348      14.65
3                    |     0.400      0.310     0.490      39.77
4                    |     0.260      0.154     0.366      28.80
5                    |     0.560      0.322     0.798       5.64
---------------------+----------------------------------------------
Overall, IV          |     0.347      0.291     0.404     100.00
--------------------------------------------------------------------

Test of overall effect = 0:  z =  12.014  p = 0.000


Heterogeneity measures, calculated from the data
with Conf. Intervals based on non-central chi² (common-effect) distribution for
>  Q
---------------------------------------------------------
Measure              |     Value      df      p-value
---------------------+-----------------------------------
Cochran's Q          |     12.82        4      0.012
                     |            -[95% Conf. Interval]-
H                    |     1.790     1.000     2.653
I² (%)               |     68.8%      0.0%     85.8%
---------------------------------------------------------
H = relative excess in Cochran's Q over its degrees-of-freedom
I² = proportion of total variation in effect estimate due to between-study hete
> rogeneity (based on Q)
Running command: metan y1 s1, random

Studies included: 5
Participants included: Unknown

Meta-analysis pooling of aggregate data
using the random-effects inverse-variance model
with DerSimonian-Laird estimate of tau²

--------------------------------------------------------------------
Study                |   Effect    [95% Conf. Interval]   % Weight
---------------------+----------------------------------------------
1                    |     0.470      0.300     0.640      17.82
2                    |     0.200      0.052     0.348      19.84
3                    |     0.400      0.310     0.490      25.64
4                    |     0.260      0.154     0.366      24.08
5                    |     0.560      0.322     0.798      12.62
---------------------+----------------------------------------------
Overall, DL          |     0.359      0.249     0.469     100.00
--------------------------------------------------------------------

Test of overall effect = 0:  z =   6.396  p = 0.000


Heterogeneity measures, calculated from the data
with Conf. Intervals based on Gamma (random-effects) distribution for Q
---------------------------------------------------------
Measure              |     Value      df      p-value
---------------------+-----------------------------------
Cochran's Q          |     12.82        4      0.012
                     |            -[95% Conf. Interval]-
H                    |     1.790     1.000     3.071
I² (%)               |     68.8%      0.0%     89.4%
---------------------------------------------------------
H = relative excess in Cochran's Q over its degrees-of-freedom
I² = proportion of total variation in effect estimate due to between-study hete
> rogeneity (based on Q)


Heterogeneity variance estimates
-----------------------------------
Method               |     tau²
---------------------+-------------
DL                   |    0.0102
-----------------------------------
Running command: mvmeta y V, var(y1) mm nouncertainv print(bscov)
Note: using method mm2
Note: using variable y1
Note: 5 observations on 1 variables
(option nouncertainv ignored with estimation method mm2)

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = mm2                                   Number of dimensions    =     1
                                               Number of observations  =     5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   .3592805   .0561749     6.40   0.000     .2491796    .4693814
------------------------------------------------------------------------------

Estimated between-studies covariance matrix Sigma
-------------------------------------------------
           y1
y1  .01020625
-------------------------------------------------
Running command: mvmeta y V pubyear
Note: using method reml
Note: regressing y1 on pubyear
Note: regressing y2 on pubyear
Note: 5 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -3.9342347
rescale:       log likelihood = -3.9342347
rescale eq:    log likelihood = -3.7117386
Iteration 0:   log likelihood = -3.7117386  
Iteration 1:   log likelihood =  -3.543716  
Iteration 2:   log likelihood = -3.5399655  
Iteration 3:   log likelihood = -3.5399546  
Iteration 4:   log likelihood = -3.5399546  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -3.5399546         Number of observations  =     5
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
y1           |
     pubyear |   .0048615   .0222347     0.22   0.827    -.0387177    .0484406
       _cons |   .3587569   .0740749     4.84   0.000     .2135728    .5039411
-------------+----------------------------------------------------------------
y2           |
     pubyear |  -.0115367   .0303001    -0.38   0.703    -.0709237    .0478504
       _cons |  -.3357368   .0985988    -3.41   0.001    -.5289869   -.1424866
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .14299169          1          .
y2  .20213143  .56138499          1
----------------------------------------------------
Running command: use p53, clear
(Mutant vs. normal p53 gene (Richard Riley's data). Unknown within-study corrs.
> )
Running command: l, noo sep(0) abb(12)

  +----------------------------------------------------+
  | study   lnHRos   lnHRdfs   VlnHRosos   VlnHRdfsdfs |
  |----------------------------------------------------|
  |     1     -.18      -.58       .3136         .3136 |
  |     2      .79         .       .0576             . |
  |     3      .21         .       .4356             . |
  |     4     -.63     -1.02       .0841         .1521 |
  |     5     1.01         .       .2304             . |
  |     6     -.64      -.69         .16           .16 |
  +----------------------------------------------------+
Running command: mvmeta lnHR VlnHR, bubble noestimate wscorr(0.7)
Note: using method reml
Note: using variables lnHRos lnHRdfs
Note: 6 observations on 2 variables
Note: wscorr(0.7) used for all covariances
Note: noestimates option - model not fitted
3 missing values found for lnHRdfs and displayed at lnHRdfs=0
Running command: mvmeta lnHR VlnHR, var(lnHRdfs)
Note: using method reml
Note: using variable lnHRdfs
Warning: 3 observations have all outcomes missing, and have been dropped from a
> nalysis
Note: 3 observations on 1 variables
Note: variance-covariance matrix is unstructured
mvmeta_bscov_unstructured: start() has trace zero: changed to I(1)

initial:       log likelihood = -2.6192931
rescale:       log likelihood = -2.2476841
rescale eq:    log likelihood = -1.0691698
Iteration 0:   log likelihood = -1.0691698  
Iteration 1:   log likelihood =  -1.060856  
Iteration 2:   log likelihood =  -1.060856  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     1
Restricted log likelihood = -1.060856          Number of observations  =     3
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
     lnHRdfs |  -.8035836   .2498954    -3.22   0.001     -1.29337   -.3137977
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD    lnHRdfs
lnHRdfs  1.379e-13          1
----------------------------------------------------
Running command: mvmeta lnHR VlnHR, wscorr(0.7)
Note: using method reml
Note: using variables lnHRos lnHRdfs
Note: 6 observations on 2 variables
Note: wscorr(0.7) used for all covariances
Note: variance-covariance matrix is unstructured

initial:       log likelihood =  -7.653669
rescale:       log likelihood =  -7.653669
rescale eq:    log likelihood = -7.5158116
Iteration 0:   log likelihood = -7.5158116  
Iteration 1:   log likelihood =  -7.032397  
Iteration 2:   log likelihood = -6.9381085  
Iteration 3:   log likelihood = -6.9260302  
Iteration 4:   log likelihood = -6.9260036  
Iteration 5:   log likelihood = -6.9260036  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -6.9260036         Number of observations  =     6
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
      lnHRos |    .093841   .3103687     0.30   0.762    -.5144706    .7021525
     lnHRdfs |  -.3233235   .4240868    -0.76   0.446    -1.154518    .5078713
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD     lnHRos    lnHRdfs
 lnHRos  .62624655          1          .
lnHRdfs  .46334668          1          1
----------------------------------------------------
Running command: mvmeta, i2

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -6.9260036         Number of observations  =     6
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
      lnHRos |    .093841   .3103687     0.30   0.762    -.5144706    .7021525
     lnHRdfs |  -.3233235   .4240868    -0.76   0.446    -1.154518    .5078713
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD     lnHRos    lnHRdfs
 lnHRos  .62624655          1          .
lnHRdfs  .46334668          1          1
----------------------------------------------------

Approximate confidence intervals for between-studies SDs and I^2:
------------------------------------------------------------------------------
Variable         SD        [95% Conf. Interval]   I^2     [95% Conf. Interval]
------------------------------------------------------------------------------
lnHRos          .62624655  .10490578  1.1475873      73        7         90
lnHRdfs         .46334668  0          1.3555925      52        0         90 *
------------------------------------------------------------------------------
Note: I^2 computed from estimated between-studies variance
      and typical within-studies variances
Note: CIs computed on SD scale
* CI for I^2 ignores zero variance components

Between-study correlations:
----------------------------------------------------
Variables          Correl.    [95% Conf. Interval]
----------------------------------------------------
lnHRos & lnHRdfs   1          .          .
----------------------------------------------------
Note: CI computed on log((1+corr)/(1-corr)) scale
Running command: mvmeta, eform

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -6.9260036         Number of observations  =     6
------------------------------------------------------------------------------
             |  exp(Coef)   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
      lnHRos |   1.098385   .3409044     0.30   0.762      .597817    2.018092
     lnHRdfs |   .7237397   .3069284    -0.76   0.446     .3152093     1.66175
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD     lnHRos    lnHRdfs
 lnHRos  .62624655          1          .
lnHRdfs  .46334668          1          1
----------------------------------------------------
Running command: mvmeta, showall

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -6.9260036         Number of observations  =     6
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
      lnHRos |    .093841   .3103687     0.30   0.762    -.5144706    .7021525
     lnHRdfs |  -.3233235   .4240868    -0.76   0.446    -1.154518    .5078713
-------------+----------------------------------------------------------------
chol11       |
       _cons |   .6262465   .2659951     2.35   0.019     .1049058    1.147587
-------------+----------------------------------------------------------------
chol12       |
       _cons |   .4633467   .4552358     1.02   0.309    -.4288991    1.355592
-------------+----------------------------------------------------------------
chol22       |
       _cons |   2.13e-12   .2816654     0.00   1.000    -.5520541    .5520541
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD     lnHRos    lnHRdfs
 lnHRos  .62624655          1          .
lnHRdfs  .46334668          1          1
----------------------------------------------------
Running command: mvmeta lnHR VlnHR, wscorr(riley)
Note: using method reml
Note: using variables lnHRos lnHRdfs
Note: 6 observations on 2 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -9.6593596
rescale:       log likelihood = -8.9269882
rescale eq:    log likelihood = -7.7361107
Iteration 0:   log likelihood = -7.7361107  (not concave)
Iteration 1:   log likelihood = -7.6187485  (not concave)
Iteration 2:   log likelihood = -7.6151104  (not concave)
Iteration 3:   log likelihood = -7.5522903  (not concave)
Iteration 4:   log likelihood = -7.4519409  (not concave)
Iteration 5:   log likelihood =  -7.289418  (not concave)
Iteration 6:   log likelihood = -6.6684806  (not concave)
Iteration 7:   log likelihood = -6.5621804  (not concave)
Iteration 8:   log likelihood = -6.5366625  (not concave)
Iteration 9:   log likelihood = -6.5116867  (not concave)
Iteration 10:  log likelihood = -6.5059096  (not concave)
Iteration 11:  log likelihood = -6.5002363  (not concave)
Iteration 12:  log likelihood = -6.4999659  (not concave)
Iteration 13:  log likelihood = -6.4998365  (not concave)
Iteration 14:  log likelihood = -6.4997678  (not concave)
Iteration 15:  log likelihood = -6.4997013  (not concave)
Iteration 16:  log likelihood =  -6.499679  (not concave)
Iteration 17:  log likelihood = -6.4996678  (not concave)
Iteration 18:  log likelihood =  -6.499656  (not concave)
Iteration 19:  log likelihood = -6.4996532  (not concave)
Iteration 20:  log likelihood = -6.4996504  (not concave)
Iteration 21:  log likelihood = -6.4996497  (not concave)
Iteration 22:  log likelihood =  -6.499649  (not concave)
Iteration 23:  log likelihood = -6.4996489  (not concave)
Iteration 24:  log likelihood = -6.4996488  (not concave)
Iteration 25:  log likelihood = -6.4996488  (not concave)
Iteration 26:  log likelihood = -6.4996482  (not concave)
Iteration 27:  log likelihood = -6.4996477  (not concave)
Iteration 28:  log likelihood = -6.4996476  (not concave)
Iteration 29:  log likelihood = -6.4996475  (not concave)
Iteration 30:  log likelihood = -6.4996468  (not concave)
Iteration 31:  log likelihood = -6.4996456  (not concave)
Iteration 32:  log likelihood = -6.4996454  (not concave)
Iteration 33:  log likelihood = -6.4996454  (not concave)
Iteration 34:  log likelihood = -6.4996453  (not concave)
Iteration 35:  log likelihood = -6.4996453  (not concave)
Iteration 36:  log likelihood = -6.4996452  (not concave)
Iteration 37:  log likelihood = -6.4996452  (not concave)
Iteration 38:  log likelihood = -6.4996452  (not concave)
Iteration 39:  log likelihood = -6.4996451  (not concave)
Iteration 40:  log likelihood = -6.4996451  (not concave)
Iteration 41:  log likelihood = -6.4996451  (not concave)
Iteration 42:  log likelihood =  -6.499645  (not concave)
Iteration 43:  log likelihood =  -6.499645  (not concave)
Iteration 44:  log likelihood =  -6.499645  (not concave)
Iteration 45:  log likelihood = -6.4996449  (not concave)
Iteration 46:  log likelihood = -6.4996449  (not concave)
Iteration 47:  log likelihood = -6.4996448  (not concave)
Iteration 48:  log likelihood = -6.4996448  (not concave)
Iteration 49:  log likelihood = -6.4996448  (not concave)
Iteration 50:  log likelihood = -6.4996447  (not concave)
Iteration 51:  log likelihood = -6.4996447  (not concave)
Iteration 52:  log likelihood = -6.4996447  (not concave)
Iteration 53:  log likelihood = -6.4996446  (not concave)
Iteration 54:  log likelihood = -6.4996446  (not concave)
Iteration 55:  log likelihood = -6.4996446  (not concave)
Iteration 56:  log likelihood = -6.4996445  (not concave)
Iteration 57:  log likelihood = -6.4996445  (not concave)
Iteration 58:  log likelihood = -6.4996445  (not concave)
Iteration 59:  log likelihood = -6.4996444  (not concave)
Iteration 60:  log likelihood = -6.4996444  (not concave)
Iteration 61:  log likelihood = -6.4996443  (not concave)
Iteration 62:  log likelihood = -6.4996443  (not concave)
Iteration 63:  log likelihood = -6.4996443  (not concave)
Iteration 64:  log likelihood = -6.4996442  (not concave)
Iteration 65:  log likelihood = -6.4996442  (not concave)
Iteration 66:  log likelihood = -6.4996442  (not concave)
Iteration 67:  log likelihood = -6.4996441  (not concave)
Iteration 68:  log likelihood = -6.4996441  (not concave)
Iteration 69:  log likelihood = -6.4996441  (not concave)
Iteration 70:  log likelihood =  -6.499644  (not concave)
Iteration 71:  log likelihood =  -6.499644  (not concave)
Iteration 72:  log likelihood =  -6.499644  (not concave)
Iteration 73:  log likelihood = -6.4996439  (not concave)
Iteration 74:  log likelihood = -6.4996439  (not concave)
Iteration 75:  log likelihood = -6.4996438  (not concave)
Iteration 76:  log likelihood = -6.4996438  (not concave)
Iteration 77:  log likelihood = -6.4996438  (not concave)
Iteration 78:  log likelihood = -6.4996437  (not concave)
Iteration 79:  log likelihood = -6.4996437  (not concave)
Iteration 80:  log likelihood = -6.4996437  (not concave)
Iteration 81:  log likelihood = -6.4996436  (not concave)
Iteration 82:  log likelihood = -6.4996436  (not concave)
Iteration 83:  log likelihood = -6.4996436  (not concave)
Iteration 84:  log likelihood = -6.4996435  (not concave)
Iteration 85:  log likelihood = -6.4996435  (not concave)
Iteration 86:  log likelihood = -6.4996434  (not concave)
Iteration 87:  log likelihood = -6.4996434  (not concave)
Iteration 88:  log likelihood = -6.4996434  (not concave)
Iteration 89:  log likelihood = -6.4996433  (not concave)
Iteration 90:  log likelihood = -6.4996433  (not concave)
Iteration 91:  log likelihood = -6.4996433  (not concave)
Iteration 92:  log likelihood = -6.4996432  (not concave)
Iteration 93:  log likelihood = -6.4996432  (not concave)
Iteration 94:  log likelihood = -6.4996432  (not concave)
Iteration 95:  log likelihood = -6.4996431  (not concave)
Iteration 96:  log likelihood = -6.4996431  (not concave)
Iteration 97:  log likelihood =  -6.499643  (not concave)
Iteration 98:  log likelihood =  -6.499643  (not concave)
Iteration 99:  log likelihood =  -6.499643  (not concave)
Iteration 100: log likelihood = -6.4996429  (not concave)
convergence not achieved

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -6.4996429         Number of observations  =     6
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
      lnHRos |   .0954302   .2916346     0.33   0.743    -.4761631    .6670236
     lnHRdfs |  -.4510305   .2386531    -1.89   0.059    -.9187819     .016721
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
                SD     lnHRos    lnHRdfs
 lnHRos  .57214465          1          .
lnHRdfs  .00684348  .91813659          1
------------------------------------------------------------
Running command: mvmeta lnHR VlnHR, wscorr(riley) difficult
Note: using method reml
Note: using variables lnHRos lnHRdfs
Note: 6 observations on 2 variables
Note: using Riley's overall correlation model
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -9.6593596
rescale:       log likelihood = -8.9269882
rescale eq:    log likelihood = -7.7361107
Iteration 0:   log likelihood = -7.7361107  (not concave)
Iteration 1:   log likelihood = -7.6715811  (not concave)
Iteration 2:   log likelihood = -7.6715565  (not concave)
Iteration 3:   log likelihood = -7.4772316  (not concave)
Iteration 4:   log likelihood = -7.0281259  (not concave)
Iteration 5:   log likelihood = -6.7304177  (not concave)
Iteration 6:   log likelihood = -6.5555782  (not concave)
Iteration 7:   log likelihood = -6.3245561  
Iteration 8:   log likelihood = -6.2992408  
Iteration 9:   log likelihood = -6.2988275  
Iteration 10:  log likelihood =  -6.298827  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -6.298827          Number of observations  =     6
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
      lnHRos |   .1183464    .308508     0.38   0.701    -.4863181    .7230108
     lnHRdfs |  -.3021159   .3438851    -0.88   0.380    -.9761183    .3718865
------------------------------------------------------------------------------

Estimated between-studies SDs and OVERALL correlation matrix
------------------------------------------------------------
                SD     lnHRos    lnHRdfs
 lnHRos  .61687978          1          .
lnHRdfs  .39186205  .96066999          1
Warning: overall Riley correlation is near 1: estimates may be unstable
------------------------------------------------------------
Running command: use fscfpama, clear
(Fully & partly adjusted log hazard ratios of CHD on fibrinogen (FSC, 2009))
Running command: l, noo

  +------------------------------------------------------------------+
  | cohort   betafa    sefa   betapa    sepa   corrb   corra   corrm |
  |------------------------------------------------------------------|
  |      1   -0.353   0.381   -0.188   0.387   0.861   0.984   0.970 |
  |      2    0.334   0.088    0.425   0.085   0.971   0.981   0.961 |
  |      3    0.309   0.132    0.394   0.129   0.963   0.978   0.962 |
  |      4    0.324   0.198    0.435   0.191   0.963   0.988   0.976 |
  |      5    0.400   0.296    0.543   0.272   0.961   0.999   0.980 |
  |------------------------------------------------------------------|
  |      6    0.149   0.104    0.151   0.103   0.988   0.999   0.994 |
  |      7    0.262   0.120    0.327   0.117   0.974   0.996   0.982 |
  |      8    0.436   0.310    0.541   0.312   0.945   0.957   0.974 |
  |      9    0.337   0.113    0.451   0.108   0.965   0.998   0.976 |
  |     10    0.474   0.143    0.609   0.137   0.952   0.999   0.982 |
  |------------------------------------------------------------------|
  |     11    0.110   0.086    0.159   0.085   0.985   0.984   0.985 |
  |     12    0.413   0.065    0.532   0.064   0.963   0.982   0.970 |
  |     13    0.213   0.078    0.262   0.077   0.964   0.976   0.969 |
  |     14    0.062   0.175    0.129   0.170   0.962   0.989   0.976 |
  |     15        .       .    0.438   0.342       .       .       . |
  |------------------------------------------------------------------|
  |     16        .       .    0.484   0.115       .       .       . |
  |     17        .       .    0.154   0.120       .       .       . |
  |     18        .       .    0.660   0.252       .       .       . |
  |     19        .       .    0.290   0.083       .       .       . |
  |     20        .       .    0.333   0.117       .       .       . |
  |------------------------------------------------------------------|
  |     21        .       .    0.122   0.147       .       .       . |
  |     22        .       .    0.666   0.349       .       .       . |
  |     23        .       .    0.219   0.053       .       .       . |
  |     24        .       .    0.354   0.126       .       .       . |
  |     25        .       .    0.553   0.148       .       .       . |
  |------------------------------------------------------------------|
  |     26        .       .    0.338   0.087       .       .       . |
  |     27        .       .    0.439   0.083       .       .       . |
  |     28        .       .    0.215   0.045       .       .       . |
  |     29        .       .    0.304   0.278       .       .       . |
  |     30        .       .    0.429   0.108       .       .       . |
  |------------------------------------------------------------------|
  |     31        .       .    1.190   0.499       .       .       . |
  +------------------------------------------------------------------+
Running command: gen varfafa = sefa^2
(17 missing values generated)
Running command: gen varpapa = sepa^2
Running command: gen varfapa = corrb*sefa*sepa
(17 missing values generated)
Running command: mvmeta beta var, var(betafa)
Note: using method reml
Note: using variable betafa
Warning: 17 observations have all outcomes missing, and have been dropped from 
> analysis
Note: 14 observations on 1 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood =  4.0111584
rescale:       log likelihood =  4.0111584
rescale eq:    log likelihood =  4.0111584
Iteration 0:   log likelihood =  4.0111584  
Iteration 1:   log likelihood =   4.017017  
Iteration 2:   log likelihood =  4.0170183  
Iteration 3:   log likelihood =  4.0170183  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     1
Restricted log likelihood = 4.0170183          Number of observations  =    14
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
      betafa |   .2729166   .0388878     7.02   0.000     .1966979    .3491353
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
               SD     betafa
betafa  .07453356          1
----------------------------------------------------
Running command: mvmeta beta var
Note: using method reml
Note: using variables betafa betapa
Note: 31 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood =  30.466484
rescale:       log likelihood =  30.466484
rescale eq:    log likelihood =  30.533576
Iteration 0:   log likelihood =  30.533576  
Iteration 1:   log likelihood =  31.101038  (backed up)
Iteration 2:   log likelihood =   31.16933  
Iteration 3:   log likelihood =  31.169653  
Iteration 4:   log likelihood =  31.169653  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = 31.169653          Number of observations  =    31
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
      betafa |   .2713414   .0266375    10.19   0.000     .2191329    .3235499
      betapa |   .3466435   .0299949    11.56   0.000     .2878546    .4054324
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
               SD     betafa     betapa
betafa  .07388892          1          .
betapa  .10608826          1          1
----------------------------------------------------
Running command: mvmeta, wt

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = 31.169653          Number of observations  =    31
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
      betafa |   .2713414   .0266375    10.19   0.000     .2191329    .3235499
      betapa |   .3466435   .0299949    11.56   0.000     .2878546    .4054324
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
               SD     betafa     betapa
betafa  .07388892          1          .
betapa  .10608826          1          1
----------------------------------------------------

Weights using score decomposition method
Study weights and borrowing of strength (% of total for each parameter)
-----------------------------------------------------------------------
           Overall:  Overall:
            betafa    betapa
       1       0.5       0.5
       2       5.9       4.8
       3       3.1       3.2
       4       1.6       2.1
       5       0.9       1.4
       6       4.8       4.0
       7       3.6       3.6
       8       0.7       0.9
       9       3.9       3.9
      10       2.7       3.0
      11       6.7       4.8
      12       9.8       6.2
      13       7.2       5.3
      14       2.0       2.4
      15       0.6       0.7
      16       3.1       3.6
      17       3.0       3.4
      18       1.0       1.2
      19       4.2       4.8
      20       3.0       3.5
      21       2.3       2.7
      22       0.6       0.7
      23       5.4       6.2
      24       2.8       3.2
      25       2.3       2.6
      26       4.0       4.7
      27       4.2       4.8
      28       5.7       6.6
      29       0.9       1.0
      30       3.3       3.8
      31       0.3       0.3
   TOTAL     100.0     100.0
BORROWED      53.3       1.8
  DIRECT      46.7      98.2
-----------------------------------------------------------------------
Running command: l cohort sepa if inlist(cohort,1,28)

     +----------------+
     | cohort    sepa |
     |----------------|
  1. |      1   0.387 |
 28. |     28   0.045 |
     +----------------+
Running command: use fscstage1, clear
Running command: browse
Running command: mvmeta b V
Note: using method reml
Note: using variables b_Ifg_2 b_Ifg_3 b_Ifg_4 b_Ifg_5
Note: 31 observations on 4 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood =  -80.51611
rescale:       log likelihood =  -80.51611
rescale eq:    log likelihood = -80.071916
Iteration 0:   log likelihood = -80.071916  (not concave)
Iteration 1:   log likelihood = -79.723602  
Iteration 2:   log likelihood = -79.561239  
Iteration 3:   log likelihood = -79.504997  
Iteration 4:   log likelihood = -79.492132  
Iteration 5:   log likelihood = -79.489355  
Iteration 6:   log likelihood = -79.489137  
Iteration 7:   log likelihood = -79.489126  
Iteration 8:   log likelihood = -79.489126  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -79.489126         Number of observations  =    31
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
     b_Ifg_2 |   .1615843   .0796996     2.03   0.043      .005376    .3177925
     b_Ifg_3 |   .3926019   .0878114     4.47   0.000     .2204947    .5647091
     b_Ifg_4 |   .5620076   .0905924     6.20   0.000     .3844497    .7395654
     b_Ifg_5 |   .8973289   .0942602     9.52   0.000     .7125823    1.082075
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD    b_Ifg_2    b_Ifg_3    b_Ifg_4    b_Ifg_5
b_Ifg_2  .22734098          1          .          .          .
b_Ifg_3  .28611308  .98953779          1          .          .
b_Ifg_4  .30834248  .97421953  .99657554          1          .
b_Ifg_5   .3274275    .706215    .800972  .84773414          1
----------------------------------------------------
Running command: estimates store fsc2full
Running command: mvmeta b V, mm
Note: using method mm2
Note: using variables b_Ifg_2 b_Ifg_3 b_Ifg_4 b_Ifg_5
Note: 31 observations on 4 variables

Note: Sigma has 2 negative eigenvalues - these have been set to 0

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = mm2                                   Number of dimensions    =     4
                                               Number of observations  =    31
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
     b_Ifg_2 |   .1743556   .0785961     2.22   0.027     .0203101     .328401
     b_Ifg_3 |   .4185927   .0757419     5.53   0.000     .2701414    .5670441
     b_Ifg_4 |   .5753623   .0810344     7.10   0.000     .4165377    .7341868
     b_Ifg_5 |   .9214429   .0956271     9.64   0.000     .7340173    1.108868
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD    b_Ifg_2    b_Ifg_3    b_Ifg_4    b_Ifg_5
b_Ifg_2  .24023256          1          .          .          .
b_Ifg_3  .23726881  .98373608          1          .          .
b_Ifg_4  .26947718  .99154168  .99872796          1          .
b_Ifg_5  .36610214  .76187832  .86583065  .83950083          1
----------------------------------------------------
Running command: mvmeta b V, mm2
Note: using method mm2
Note: using variables b_Ifg_2 b_Ifg_3 b_Ifg_4 b_Ifg_5
Note: 31 observations on 4 variables

Note: Sigma has 2 negative eigenvalues - these have been set to 0

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = mm2                                   Number of dimensions    =     4
                                               Number of observations  =    31
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
     b_Ifg_2 |   .1743556   .0785961     2.22   0.027     .0203101     .328401
     b_Ifg_3 |   .4185927   .0757419     5.53   0.000     .2701414    .5670441
     b_Ifg_4 |   .5753623   .0810344     7.10   0.000     .4165377    .7341868
     b_Ifg_5 |   .9214429   .0956271     9.64   0.000     .7340173    1.108868
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD    b_Ifg_2    b_Ifg_3    b_Ifg_4    b_Ifg_5
b_Ifg_2  .24023256          1          .          .          .
b_Ifg_3  .23726881  .98373608          1          .          .
b_Ifg_4  .26947718  .99154168  .99872796          1          .
b_Ifg_5  .36610214  .76187832  .86583065  .83950083          1
----------------------------------------------------
Running command: mvmeta b V, fixed
Note: using method fixed
Note: using variables b_Ifg_2 b_Ifg_3 b_Ifg_4 b_Ifg_5
Note: 31 observations on 4 variables

Multivariate meta-analysis
Variance-covariance matrix = (none)
Method = fixed                                 Number of dimensions    =     4
                                               Number of observations  =    31
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
     b_Ifg_2 |   .2086679   .0523447     3.99   0.000     .1060741    .3112617
     b_Ifg_3 |   .4403124   .0502355     8.76   0.000     .3418528    .5387721
     b_Ifg_4 |   .6032061   .0498286    12.11   0.000     .5055439    .7008683
     b_Ifg_5 |   .9213903   .0507195    18.17   0.000      .821982    1.020799
------------------------------------------------------------------------------
Running command: matrix B = (1,2,3,4)'*(1,2,3,4)
Running command: mvmeta b V, bscov(prop B)
Note: using method reml
Note: using variables b_Ifg_2 b_Ifg_3 b_Ifg_4 b_Ifg_5
Note: 31 observations on 4 variables
Note: variance-covariance matrix is proportional to B

initial:       log likelihood = -134.15981
rescale:       log likelihood =  -108.0511
rescale eq:    log likelihood = -85.917006
Iteration 0:   log likelihood = -85.917006  
Iteration 1:   log likelihood = -85.664023  
Iteration 2:   log likelihood = -85.662288  
Iteration 3:   log likelihood = -85.662288  

Multivariate meta-analysis
Variance-covariance matrix = proportional B
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -85.662288         Number of observations  =    31
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
     b_Ifg_2 |   .2157173   .0552702     3.90   0.000     .1073896    .3240449
     b_Ifg_3 |   .4521318   .0593106     7.62   0.000     .3358851    .5683784
     b_Ifg_4 |   .6241456   .0679206     9.19   0.000     .4910236    .7572675
     b_Ifg_5 |   .9459649   .0780769    12.12   0.000      .792937    1.098993
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD    b_Ifg_2    b_Ifg_3    b_Ifg_4    b_Ifg_5
b_Ifg_2  .06758525          1          .          .          .
b_Ifg_3  .13517049          1          1          .          .
b_Ifg_4  .20275574          1          1          1          .
b_Ifg_5  .27034098          1          1          1          1
----------------------------------------------------
Running command: lrtest fsc2full

Likelihood-ratio test
Assumption: . nested within fsc2full

 LR chi2(9) =  12.35
Prob > chi2 = 0.1945
Running command: estimates replay fsc2full

-------------------------------------------------------------------------------
Model fsc2full
-------------------------------------------------------------------------------

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -79.489126         Number of observations  =    31
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
     b_Ifg_2 |   .1615843   .0796996     2.03   0.043      .005376    .3177925
     b_Ifg_3 |   .3926019   .0878114     4.47   0.000     .2204947    .5647091
     b_Ifg_4 |   .5620076   .0905924     6.20   0.000     .3844497    .7395654
     b_Ifg_5 |   .8973289   .0942602     9.52   0.000     .7125823    1.082075
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
                SD    b_Ifg_2    b_Ifg_3    b_Ifg_4    b_Ifg_5
b_Ifg_2  .22734098          1          .          .          .
b_Ifg_3  .28611308  .98953779          1          .          .
b_Ifg_4  .30834248  .97421953  .99657554          1          .
b_Ifg_5   .3274275    .706215    .800972  .84773414          1
----------------------------------------------------
Running command: graph use fsc2cigraph

. cd "`mvmetadir'scripts"
c:\ado\ian\mvmeta\scripts

. 
. 
. // CHECK WARNING OPTIONS WORK
. * generating warnings from
. *   -showchol-, an old option which triggers a warning
. *   a superfluous y variable
. *   superfluous wscorrforce and notrunc options
. use telomerase2, clear
(Riley's telomerase data)

. gen y=1

. foreach warning in error text off {
  2.         dicmd mvmeta y S, showchol warning(`warning') wscorrforce notrunc
  3. }


mvmeta y S, showchol warning(error) wscorrforce notrunc
Warning: wscorrforce ignored - wscorr(#) not specified
Warning: notrunc option ignored with method reml
Note: using method reml
Warning: variable y not used (looking for variable names y+suffix)
Note: using variables y1 y2
Note: 10 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -24.474456
rescale:       log likelihood = -24.474456
rescale eq:    log likelihood = -24.472315
Iteration 0:   log likelihood = -24.472315  
Iteration 1:   log likelihood =  -24.41615  
Iteration 2:   log likelihood = -24.415968  
Iteration 3:   log likelihood = -24.415968  
Warning: showchol option has been renamed showall

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -24.415968         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.166187   .1863276     6.26   0.000     .8009913    1.531382
          y2 |   2.057752   .5607259     3.67   0.000     .9587493    3.156755
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .44965665          1          .
y2  1.6073388         -1          1
----------------------------------------------------


mvmeta y S, showchol warning(text) wscorrforce notrunc
Warning: wscorrforce ignored - wscorr(#) not specified
Warning: notrunc option ignored with method reml
Note: using method reml
Warning: variable y not used (looking for variable names y+suffix)
Note: using variables y1 y2
Note: 10 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -24.474456
rescale:       log likelihood = -24.474456
rescale eq:    log likelihood = -24.472315
Iteration 0:   log likelihood = -24.472315  
Iteration 1:   log likelihood =  -24.41615  
Iteration 2:   log likelihood = -24.415968  
Iteration 3:   log likelihood = -24.415968  
Warning: showchol option has been renamed showall

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -24.415968         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.166187   .1863276     6.26   0.000     .8009913    1.531382
          y2 |   2.057752   .5607259     3.67   0.000     .9587493    3.156755
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .44965665          1          .
y2  1.6073388         -1          1
----------------------------------------------------


mvmeta y S, showchol warning(off) wscorrforce notrunc
Note: using method reml
Note: using variables y1 y2
Note: 10 observations on 2 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -24.474456
rescale:       log likelihood = -24.474456
rescale eq:    log likelihood = -24.472315
Iteration 0:   log likelihood = -24.472315  
Iteration 1:   log likelihood =  -24.41615  
Iteration 2:   log likelihood = -24.415968  
Iteration 3:   log likelihood = -24.415968  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     2
Restricted log likelihood = -24.415968         Number of observations  =    10
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
          y1 |   1.166187   .1863276     6.26   0.000     .8009913    1.531382
          y2 |   2.057752   .5607259     3.67   0.000     .9587493    3.156755
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
           SD         y1         y2
y1  .44965665          1          .
y2  1.6073388         -1          1
----------------------------------------------------

. 
. * using a data set with non-positive-definite S's 
. use fracpoly_results, clear

. * commands that fail: check the output
. foreach warning in error text off {
  2.         dicmd cap noi mvmeta b V, warning(`warning') 
  3.         di as input "Error code was " _rc _n
  4. }


cap noi mvmeta b V, warning(error)
Note: using method reml
Note: using variables bfp1 bfp2 bconf bcons
Note: 4 observations on 4 variables
Error: variance-covariance matrix not positive semi-definite at observation 3:
symmetric __00000B3[4,4]
                     bfp1        bfp2       bconf       bcons
 Study 3:bfp1   .17024867
 Study 3:bfp2  -.05226453   .01614439
Study 3:bconf  -.00128447    .0029103   .00226961
Study 3:bcons  -.18851855   .05799779  -.00547568   .23029041
Error code was 459



cap noi mvmeta b V, warning(text)
Note: using method reml
Note: using variables bfp1 bfp2 bconf bcons
Note: 4 observations on 4 variables
Error: variance-covariance matrix not positive semi-definite at observation 3:
symmetric __00000B3[4,4]
                     bfp1        bfp2       bconf       bcons
 Study 3:bfp1   .17024867
 Study 3:bfp2  -.05226453   .01614439
Study 3:bconf  -.00128447    .0029103   .00226961
Study 3:bcons  -.18851855   .05799779  -.00547568   .23029041
Error code was 459



cap noi mvmeta b V, warning(off)
Note: using method reml
Note: using variables bfp1 bfp2 bconf bcons
Note: 4 observations on 4 variables
Error: variance-covariance matrix not positive semi-definite at observation 3:
symmetric __00000B3[4,4]
                     bfp1        bfp2       bconf       bcons
 Study 3:bfp1   .17024867
 Study 3:bfp2  -.05226453   .01614439
Study 3:bconf  -.00128447    .0029103   .00226961
Study 3:bcons  -.18851855   .05799779  -.00547568   .23029041
Error code was 459


. * commands that succeed using noposdef 
. foreach warning in error text off {
  2.         dicmd mvmeta b V, noposdef warning(`warning')
  3. }


mvmeta b V, noposdef warning(error)
Note: using method reml
Note: using variables bfp1 bfp2 bconf bcons
Note: 4 observations on 4 variables
Warning: variance-covariance matrix not positive semi-definite at observation 3
> :
symmetric __00000B3[4,4]
                     bfp1        bfp2       bconf       bcons
 Study 3:bfp1   .17024867
 Study 3:bfp2  -.05226453   .01614439
Study 3:bconf  -.00128447    .0029103   .00226961
Study 3:bcons  -.18851855   .05799779  -.00547568   .23029041
Warning: this may cause estimation to fail

Warning: variance-covariance matrix not positive semi-definite at observation 4
> :
symmetric __00000B4[4,4]
                     bfp1        bfp2       bconf       bcons
 Study 4:bfp1   .37670001
 Study 4:bfp2       -.124       .0411
Study 4:bconf      .00015      -.0003       .0022
Study 4:bcons  -.41150001       .1356      -.0055        .463
Warning: this may cause estimation to fail

Note: variance-covariance matrix is unstructured

initial:       log likelihood = -4.0528698
rescale:       log likelihood = -4.0528698
rescale eq:    log likelihood = -1.8317916
Iteration 0:   log likelihood = -1.8317916  (not concave)
Iteration 1:   log likelihood = -1.4170243  (not concave)
Iteration 2:   log likelihood =  -1.206974  (not concave)
Iteration 3:   log likelihood =  -1.181411  (not concave)
Iteration 4:   log likelihood = -1.1693458  (not concave)
Iteration 5:   log likelihood = -1.1613045  (not concave)
Iteration 6:   log likelihood = -1.1605093  (not concave)
Iteration 7:   log likelihood = -1.1534407  (not concave)
Iteration 8:   log likelihood = -1.1431655  (not concave)
Iteration 9:   log likelihood = -1.1413669  
Iteration 10:  log likelihood = -1.1178157  (not concave)
Iteration 11:  log likelihood = -1.0983373  
Iteration 12:  log likelihood = -1.0892157  
Iteration 13:  log likelihood = -1.0868483  
Iteration 14:  log likelihood = -1.0861302  
Iteration 15:  log likelihood = -1.0861282  
Iteration 16:  log likelihood = -1.0861282  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -1.0861282         Number of observations  =     4
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
        bfp1 |  -2.720035   .3594122    -7.57   0.000     -3.42447     -2.0156
        bfp2 |   .8111933    .117237     6.92   0.000     .5814129    1.040974
       bconf |   .6104814   .1249432     4.89   0.000     .3655973    .8553656
       bcons |  -.9674668   .3212434    -3.01   0.003    -1.597092   -.3378412
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
               SD        bfp1        bfp2       bconf       bcons
 bfp1    .5872743           1           .           .           .
 bfp2   .19322501  -.93055828           1           .           .
bconf   .24469169  -.84109409   .64005537           1           .
bcons   .42983063   .96497212   -.9899645  -.74205767           1
----------------------------------------------------


mvmeta b V, noposdef warning(text)
Note: using method reml
Note: using variables bfp1 bfp2 bconf bcons
Note: 4 observations on 4 variables
Warning: variance-covariance matrix not positive semi-definite at observation 3
> :
symmetric __00000B3[4,4]
                     bfp1        bfp2       bconf       bcons
 Study 3:bfp1   .17024867
 Study 3:bfp2  -.05226453   .01614439
Study 3:bconf  -.00128447    .0029103   .00226961
Study 3:bcons  -.18851855   .05799779  -.00547568   .23029041
Warning: this may cause estimation to fail

Warning: variance-covariance matrix not positive semi-definite at observation 4
> :
symmetric __00000B4[4,4]
                     bfp1        bfp2       bconf       bcons
 Study 4:bfp1   .37670001
 Study 4:bfp2       -.124       .0411
Study 4:bconf      .00015      -.0003       .0022
Study 4:bcons  -.41150001       .1356      -.0055        .463
Warning: this may cause estimation to fail

Note: variance-covariance matrix is unstructured

initial:       log likelihood = -4.0528698
rescale:       log likelihood = -4.0528698
rescale eq:    log likelihood = -1.8317916
Iteration 0:   log likelihood = -1.8317916  (not concave)
Iteration 1:   log likelihood = -1.4170243  (not concave)
Iteration 2:   log likelihood =  -1.206974  (not concave)
Iteration 3:   log likelihood =  -1.181411  (not concave)
Iteration 4:   log likelihood = -1.1693458  (not concave)
Iteration 5:   log likelihood = -1.1613045  (not concave)
Iteration 6:   log likelihood = -1.1605093  (not concave)
Iteration 7:   log likelihood = -1.1534407  (not concave)
Iteration 8:   log likelihood = -1.1431655  (not concave)
Iteration 9:   log likelihood = -1.1413669  
Iteration 10:  log likelihood = -1.1178157  (not concave)
Iteration 11:  log likelihood = -1.0983373  
Iteration 12:  log likelihood = -1.0892157  
Iteration 13:  log likelihood = -1.0868483  
Iteration 14:  log likelihood = -1.0861302  
Iteration 15:  log likelihood = -1.0861282  
Iteration 16:  log likelihood = -1.0861282  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -1.0861282         Number of observations  =     4
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
        bfp1 |  -2.720035   .3594122    -7.57   0.000     -3.42447     -2.0156
        bfp2 |   .8111933    .117237     6.92   0.000     .5814129    1.040974
       bconf |   .6104814   .1249432     4.89   0.000     .3655973    .8553656
       bcons |  -.9674668   .3212434    -3.01   0.003    -1.597092   -.3378412
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
               SD        bfp1        bfp2       bconf       bcons
 bfp1    .5872743           1           .           .           .
 bfp2   .19322501  -.93055828           1           .           .
bconf   .24469169  -.84109409   .64005537           1           .
bcons   .42983063   .96497212   -.9899645  -.74205767           1
----------------------------------------------------


mvmeta b V, noposdef warning(off)
Note: using method reml
Note: using variables bfp1 bfp2 bconf bcons
Note: 4 observations on 4 variables
Note: variance-covariance matrix is unstructured

initial:       log likelihood = -4.0528698
rescale:       log likelihood = -4.0528698
rescale eq:    log likelihood = -1.8317916
Iteration 0:   log likelihood = -1.8317916  (not concave)
Iteration 1:   log likelihood = -1.4170243  (not concave)
Iteration 2:   log likelihood =  -1.206974  (not concave)
Iteration 3:   log likelihood =  -1.181411  (not concave)
Iteration 4:   log likelihood = -1.1693458  (not concave)
Iteration 5:   log likelihood = -1.1613045  (not concave)
Iteration 6:   log likelihood = -1.1605093  (not concave)
Iteration 7:   log likelihood = -1.1534407  (not concave)
Iteration 8:   log likelihood = -1.1431655  (not concave)
Iteration 9:   log likelihood = -1.1413669  
Iteration 10:  log likelihood = -1.1178157  (not concave)
Iteration 11:  log likelihood = -1.0983373  
Iteration 12:  log likelihood = -1.0892157  
Iteration 13:  log likelihood = -1.0868483  
Iteration 14:  log likelihood = -1.0861302  
Iteration 15:  log likelihood = -1.0861282  
Iteration 16:  log likelihood = -1.0861282  

Multivariate meta-analysis
Variance-covariance matrix = unstructured
Method = reml                                  Number of dimensions    =     4
Restricted log likelihood = -1.0861282         Number of observations  =     4
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Overall_mean |
        bfp1 |  -2.720035   .3594122    -7.57   0.000     -3.42447     -2.0156
        bfp2 |   .8111933    .117237     6.92   0.000     .5814129    1.040974
       bconf |   .6104814   .1249432     4.89   0.000     .3655973    .8553656
       bcons |  -.9674668   .3212434    -3.01   0.003    -1.597092   -.3378412
------------------------------------------------------------------------------

Estimated between-studies SDs and correlation matrix
----------------------------------------------------
               SD        bfp1        bfp2       bconf       bcons
 bfp1    .5872743           1           .           .           .
 bfp2   .19322501  -.93055828           1           .           .
bconf   .24469169  -.84109409   .64005537           1           .
bcons   .42983063   .96497212   -.9899645  -.74205767           1
----------------------------------------------------

. 
. // CHECK OBSERROR
. use telomerase2, clear
(Riley's telomerase data)

. replace S11=. in 3
(1 real change made, 1 to missing)

. cap mvmeta y S

. assert _rc==459

. assert $MVMETA_obserror==3

. 
. // TIDY UP
. clear

. erase "`mvmetadir'scripts/z.dta

. 
. di as result _n "****************************************" ///
>         _n "*** MVMETA HAS PASSED ALL ITS TESTS ***" ///
>         _n "****************************************"

****************************************
*** MVMETA HAS PASSED ALL ITS TESTS ***
****************************************

. 
. log close
      name:  <unnamed>
       log:  c:\ado\ian\mvmeta\testlogs\mvmeta_cscript.log
  log type:  text
 closed on:   7 Apr 2022, 17:44:59
-------------------------------------------------------------------------------
